hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
/* SPDX-License-Identifier: BSD-3-Clause */

/**
 * @file
 *
 * @ingroup RTEMSBSPsARMimxrt
 *
 * @brief Pin function definitions for i.MXRT1166.
 *
 * Note: This file is basically a reformatted version of the fsl_iomuxc.h. RTEMS
 * uses a driver based on the FreeBSD iomux driver for the i.mx6. That driver
 * expects a different order of the values.
 */

/*
 * Copyright 2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * Copyright (C) 2023 embedded brains GmbH & Co. KG
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef LIBBSP_ARM_IMXRT_IMXRT1176_PINFUNC_H
#define LIBBSP_ARM_IMXRT_IMXRT1176_PINFUNC_H

#ifdef __cplusplus
extern "C"
{
#endif /* __cplusplus */

    /* LPSR pins. Base address is 0x40c08000 */

#define IMXRT_PAD_GPIO_LPSR_00_FLEXCAN3_TX 0x000 0x040 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_00_MIC_CLK 0x000 0x040 0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_00_MQS_RIGHT 0x000 0x040 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_00_ARM_CM4_EVENTO 0x000 0x040 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_00_GPIO_MUX6_IO00 0x000 0x040 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_00_LPUART12_TXD 0x000 0x040 0x0B0 0x6 0
#define IMXRT_PAD_GPIO_LPSR_00_SAI4_MCLK 0x000 0x040 0x0C8 0x7 0
#define IMXRT_PAD_GPIO_LPSR_00_GPIO12_IO00 0x000 0x040 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_01_FLEXCAN3_RX 0x004 0x044 0x080 0x0 0
#define IMXRT_PAD_GPIO_LPSR_01_MIC_BITSTREAM0 0x004 0x044 0x0B4 0x1 0
#define IMXRT_PAD_GPIO_LPSR_01_MQS_LEFT 0x004 0x044 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_01_ARM_CM4_EVENTI 0x004 0x044 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_01_GPIO_MUX6_IO01 0x004 0x044 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_01_LPUART12_RXD 0x004 0x044 0x0AC 0x6 0
#define IMXRT_PAD_GPIO_LPSR_01_GPIO12_IO01 0x004 0x044 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_02_GPIO12_IO02 0x008 0x048 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_02_SRC_BOOT_MODE00 0x008 0x048 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_02_LPSPI5_SCK 0x008 0x048 0x098 0x1 0
#define IMXRT_PAD_GPIO_LPSR_02_SAI4_TX_DATA 0x008 0x048 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_02_MQS_RIGHT 0x008 0x048 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_02_GPIO_MUX6_IO02 0x008 0x048 0 0x5 0

#define IMXRT_PAD_GPIO_LPSR_03_SRC_BOOT_MODE01 0x00C 0x04C 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_03_LPSPI5_PCS0 0x00C 0x04C 0x094 0x1 0
#define IMXRT_PAD_GPIO_LPSR_03_SAI4_TX_SYNC 0x00C 0x04C 0x0DC 0x2 0
#define IMXRT_PAD_GPIO_LPSR_03_MQS_LEFT 0x00C 0x04C 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_03_GPIO_MUX6_IO03 0x00C 0x04C 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_03_GPIO12_IO03 0x00C 0x04C 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_04_LPI2C5_SDA 0x010 0x050 0x088 0x0 0
#define IMXRT_PAD_GPIO_LPSR_04_LPSPI5_SOUT 0x010 0x050 0x0A0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_04_SAI4_TX_BCLK 0x010 0x050 0x0D8 0x2 0
#define IMXRT_PAD_GPIO_LPSR_04_LPUART12_RTS_B 0x010 0x050 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_04_GPIO_MUX6_IO04 0x010 0x050 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_04_LPUART11_TXD 0x010 0x050 0x0A8 0x6 0
#define IMXRT_PAD_GPIO_LPSR_04_GPIO12_IO04 0x010 0x050 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_05_GPIO12_IO05 0x014 0x054 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_05_LPI2C5_SCL 0x014 0x054 0x084 0x0 0
#define IMXRT_PAD_GPIO_LPSR_05_LPSPI5_SIN 0x014 0x054 0x09C 0x1 0
#define IMXRT_PAD_GPIO_LPSR_05_SAI4_MCLK 0x014 0x054 0x0C8 0x2 1
#define IMXRT_PAD_GPIO_LPSR_05_LPUART12_CTS_B 0x014 0x054 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_05_GPIO_MUX6_IO05 0x014 0x054 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_05_LPUART11_RXD 0x014 0x054 0x0A4 0x6 0
#define IMXRT_PAD_GPIO_LPSR_05_NMI_GLUE_NMI 0x014 0x054 0x0C4 0x7 0

#define IMXRT_PAD_GPIO_LPSR_06_LPI2C6_SDA 0x018 0x058 0x090 0x0 0
#define IMXRT_PAD_GPIO_LPSR_06_SAI4_RX_DATA 0x018 0x058 0x0D0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_06_LPUART12_TXD 0x018 0x058 0x0B0 0x3 1
#define IMXRT_PAD_GPIO_LPSR_06_LPSPI6_PCS3 0x018 0x058 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_06_GPIO_MUX6_IO06 0x018 0x058 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_06_FLEXCAN3_TX 0x018 0x058 0 0x6 0
#define IMXRT_PAD_GPIO_LPSR_06_PIT2_TRIGGER3 0x018 0x058 0 0x7 0
#define IMXRT_PAD_GPIO_LPSR_06_LPSPI5_PCS1 0x018 0x058 0 0x8 0
#define IMXRT_PAD_GPIO_LPSR_06_GPIO12_IO06 0x018 0x058 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_07_LPI2C6_SCL 0x01C 0x05C 0x08C 0x0 0
#define IMXRT_PAD_GPIO_LPSR_07_SAI4_RX_BCLK 0x01C 0x05C 0x0CC 0x2 0
#define IMXRT_PAD_GPIO_LPSR_07_LPUART12_RXD 0x01C 0x05C 0x0AC 0x3 1
#define IMXRT_PAD_GPIO_LPSR_07_LPSPI6_PCS2 0x01C 0x05C 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_07_GPIO_MUX6_IO07 0x01C 0x05C 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_07_FLEXCAN3_RX 0x01C 0x05C 0x080 0x6 1
#define IMXRT_PAD_GPIO_LPSR_07_PIT2_TRIGGER2 0x01C 0x05C 0 0x7 0
#define IMXRT_PAD_GPIO_LPSR_07_LPSPI5_PCS2 0x01C 0x05C 0 0x8 0
#define IMXRT_PAD_GPIO_LPSR_07_GPIO12_IO07 0x01C 0x05C 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_08_GPIO12_IO08 0x020 0x060 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_08_LPUART11_TXD 0x020 0x060 0x0A8 0x0 1
#define IMXRT_PAD_GPIO_LPSR_08_FLEXCAN3_TX 0x020 0x060 0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_08_SAI4_RX_SYNC 0x020 0x060 0x0D4 0x2 0
#define IMXRT_PAD_GPIO_LPSR_08_MIC_CLK 0x020 0x060 0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_08_LPSPI6_PCS1 0x020 0x060 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_08_GPIO_MUX6_IO08 0x020 0x060 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_08_LPI2C5_SDA 0x020 0x060 0x088 0x6 1
#define IMXRT_PAD_GPIO_LPSR_08_PIT2_TRIGGER1 0x020 0x060 0 0x7 0
#define IMXRT_PAD_GPIO_LPSR_08_LPSPI5_PCS3 0x020 0x060 0 0x8 0

#define IMXRT_PAD_GPIO_LPSR_09_GPIO12_IO09 0x024 0x064 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_09_LPUART11_RXD 0x024 0x064 0x0A4 0x0 1
#define IMXRT_PAD_GPIO_LPSR_09_FLEXCAN3_RX 0x024 0x064 0x080 0x1 2
#define IMXRT_PAD_GPIO_LPSR_09_PIT2_TRIGGER0 0x024 0x064 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_09_MIC_BITSTREAM0 0x024 0x064 0x0B4 0x3 1
#define IMXRT_PAD_GPIO_LPSR_09_LPSPI6_PCS0 0x024 0x064 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_09_GPIO_MUX6_IO09 0x024 0x064 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_09_LPI2C5_SCL 0x024 0x064 0x084 0x6 1
#define IMXRT_PAD_GPIO_LPSR_09_SAI4_TX_DATA 0x024 0x064 0 0x7 0

#define IMXRT_PAD_GPIO_LPSR_10_GPIO12_IO10 0x028 0x068 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_10_JTAG_MUX_TRSTB 0x028 0x068 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_10_LPUART11_CTS_B 0x028 0x068 0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_10_LPI2C6_SDA 0x028 0x068 0x090 0x2 1
#define IMXRT_PAD_GPIO_LPSR_10_MIC_BITSTREAM1 0x028 0x068 0x0B8 0x3 0
#define IMXRT_PAD_GPIO_LPSR_10_LPSPI6_SCK 0x028 0x068 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_10_GPIO_MUX6_IO10 0x028 0x068 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_10_LPI2C5_SCLS 0x028 0x068 0 0x6 0
#define IMXRT_PAD_GPIO_LPSR_10_SAI4_TX_SYNC 0x028 0x068 0x0DC 0x7 1
#define IMXRT_PAD_GPIO_LPSR_10_LPUART12_TXD 0x028 0x068 0x0B0 0x8 2

#define IMXRT_PAD_GPIO_LPSR_11_JTAG_MUX_TDO 0x02C 0x06C 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_11_LPUART11_RTS_B 0x02C 0x06C 0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_11_LPI2C6_SCL 0x02C 0x06C 0x08C 0x2 1
#define IMXRT_PAD_GPIO_LPSR_11_MIC_BITSTREAM2 0x02C 0x06C 0x0BC 0x3 0
#define IMXRT_PAD_GPIO_LPSR_11_LPSPI6_SOUT 0x02C 0x06C 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_11_GPIO_MUX6_IO11 0x02C 0x06C 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_11_LPI2C5_SDAS 0x02C 0x06C 0 0x6 0
#define IMXRT_PAD_GPIO_LPSR_11_ARM_TRACE_SWO 0x02C 0x06C 0 0x7 0
#define IMXRT_PAD_GPIO_LPSR_11_LPUART12_RXD 0x02C 0x06C 0x0AC 0x8 2
#define IMXRT_PAD_GPIO_LPSR_11_GPIO12_IO11 0x02C 0x06C 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_12_GPIO12_IO12 0x030 0x070 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_12_JTAG_MUX_TDI 0x030 0x070 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_12_PIT2_TRIGGER0 0x030 0x070 0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_12_MIC_BITSTREAM3 0x030 0x070 0x0C0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_12_LPSPI6_SIN 0x030 0x070 0 0x4 0
#define IMXRT_PAD_GPIO_LPSR_12_GPIO_MUX6_IO12 0x030 0x070 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_12_LPI2C5_HREQ 0x030 0x070 0 0x6 0
#define IMXRT_PAD_GPIO_LPSR_12_SAI4_TX_BCLK 0x030 0x070 0x0D8 0x7 1
#define IMXRT_PAD_GPIO_LPSR_12_LPSPI5_SCK 0x030 0x070 0x098 0x8 1

