hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_LPSR_13_GPIO12_IO13 0x034 0x074 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_13_JTAG_MUX_MOD 0x034 0x074 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_13_MIC_BITSTREAM1 0x034 0x074 0x0B8 0x1 1
#define IMXRT_PAD_GPIO_LPSR_13_PIT2_TRIGGER1 0x034 0x074 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_13_GPIO_MUX6_IO13 0x034 0x074 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_13_SAI4_RX_DATA 0x034 0x074 0x0D0 0x7 1
#define IMXRT_PAD_GPIO_LPSR_13_LPSPI5_PCS0 0x034 0x074 0x094 0x8 1

#define IMXRT_PAD_GPIO_LPSR_14_JTAG_MUX_TCK 0x038 0x078 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_14_MIC_BITSTREAM2 0x038 0x078 0x0BC 0x1 1
#define IMXRT_PAD_GPIO_LPSR_14_PIT2_TRIGGER2 0x038 0x078 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_14_GPIO_MUX6_IO14 0x038 0x078 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_14_SAI4_RX_BCLK 0x038 0x078 0x0CC 0x7 1
#define IMXRT_PAD_GPIO_LPSR_14_LPSPI5_SOUT 0x038 0x078 0x0A0 0x8 1
#define IMXRT_PAD_GPIO_LPSR_14_GPIO12_IO14 0x038 0x078 0 0xA 0

#define IMXRT_PAD_GPIO_LPSR_15_GPIO12_IO15 0x03C 0x07C 0 0xA 0
#define IMXRT_PAD_GPIO_LPSR_15_JTAG_MUX_TMS 0x03C 0x07C 0 0x0 0
#define IMXRT_PAD_GPIO_LPSR_15_MIC_BITSTREAM3 0x03C 0x07C 0x0C0 0x1 1
#define IMXRT_PAD_GPIO_LPSR_15_PIT2_TRIGGER3 0x03C 0x07C 0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_15_GPIO_MUX6_IO15 0x03C 0x07C 0 0x5 0
#define IMXRT_PAD_GPIO_LPSR_15_SAI4_RX_SYNC 0x03C 0x07C 0x0D4 0x7 1
#define IMXRT_PAD_GPIO_LPSR_15_LPSPI5_SIN 0x03C 0x07C 0x09C 0x8 1

    /* SNVS pins. Base address is 0x40c94000 */

#define IMXRT_PAD_WAKEUP_DIG_GPIO13_IO00 0x000 0x040 0 0x5 0
    /* NOTE: Can't handle that pin. It's distributed between SNVS and LPSR */
    // #define IMXRT_PAD_WAKEUP_DIG_NMI_GLUE_NMI           0x000 0x040 0x40C080C4 0x7 1

#define IMXRT_PAD_PMIC_ON_REQ_DIG_SNVS_LP_PMIC_ON_REQ 0x004 0x044 0 0x0 0
#define IMXRT_PAD_PMIC_ON_REQ_DIG_GPIO13_IO01 0x004 0x044 0 0x5 0

#define IMXRT_PAD_PMIC_STBY_REQ_DIG_CCM_PMIC_VSTBY_REQ 0x008 0x048 0 0x0 0
#define IMXRT_PAD_PMIC_STBY_REQ_DIG_GPIO13_IO02 0x008 0x048 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_00_DIG_SNVS_TAMPER0 0x00C 0x04C 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_00_DIG_GPIO13_IO03 0x00C 0x04C 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_01_DIG_SNVS_TAMPER1 0x010 0x050 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_01_DIG_GPIO13_IO04 0x010 0x050 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_02_DIG_SNVS_TAMPER2 0x014 0x054 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_02_DIG_GPIO13_IO05 0x014 0x054 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_03_DIG_SNVS_TAMPER3 0x018 0x058 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_03_DIG_GPIO13_IO06 0x018 0x058 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_04_DIG_SNVS_TAMPER4 0x01C 0x05C 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_04_DIG_GPIO13_IO07 0x01C 0x05C 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_05_DIG_SNVS_TAMPER5 0x020 0x060 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_05_DIG_GPIO13_IO08 0x020 0x060 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_06_DIG_SNVS_TAMPER6 0x024 0x064 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_06_DIG_GPIO13_IO09 0x024 0x064 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_07_DIG_SNVS_TAMPER7 0x028 0x068 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_07_DIG_GPIO13_IO10 0x028 0x068 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_08_DIG_SNVS_TAMPER8 0x02C 0x06C 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_08_DIG_GPIO13_IO11 0x02C 0x06C 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_09_DIG_SNVS_TAMPER9 0x030 0x070 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_09_DIG_GPIO13_IO12 0x030 0x070 0 0x5 0

#define IMXRT_PAD_TEST_MODE_DIG 0 0x034 0 0 0

#define IMXRT_PAD_POR_B_DIG 0 0x038 0 0 0

#define IMXRT_PAD_ONOFF_DIG 0 0x03C 0 0 0

    /* Normal pins. Base address is 0x400e8000 */

#define IMXRT_PAD_GPIO_EMC_B1_00_SEMC_DATA00 0x010 0x254 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A 0x010 0x254 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_00_GPIO_MUX1_IO00 0x010 0x254 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_00_FLEXIO1_D00 0x010 0x254 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_00_GPIO7_IO00 0x010 0x254 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_01_GPIO7_IO01 0x014 0x258 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_01_SEMC_DATA01 0x014 0x258 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B 0x014 0x258 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_01_GPIO_MUX1_IO01 0x014 0x258 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_01_FLEXIO1_D01 0x014 0x258 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_02_SEMC_DATA02 0x018 0x25C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A 0x018 0x25C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_02_GPIO_MUX1_IO02 0x018 0x25C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_02_FLEXIO1_D02 0x018 0x25C 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_02_GPIO7_IO02 0x018 0x25C 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_03_SEMC_DATA03 0x01C 0x260 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_03_FLEXPWM4_PWM1_B 0x01C 0x260 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_03_GPIO_MUX1_IO03 0x01C 0x260 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_03_FLEXIO1_D03 0x01C 0x260 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_03_GPIO7_IO03 0x01C 0x260 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_04_GPIO7_IO04 0x020 0x264 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_04_SEMC_DATA04 0x020 0x264 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A 0x020 0x264 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_04_GPIO_MUX1_IO04 0x020 0x264 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_04_FLEXIO1_D04 0x020 0x264 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_05_SEMC_DATA05 0x024 0x268 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_05_FLEXPWM4_PWM2_B 0x024 0x268 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_05_GPIO_MUX1_IO05 0x024 0x268 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_05_FLEXIO1_D05 0x024 0x268 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_05_GPIO7_IO05 0x024 0x268 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_06_SEMC_DATA06 0x028 0x26C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_06_FLEXPWM2_PWM0_A 0x028 0x26C 0x518 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_06_GPIO_MUX1_IO06 0x028 0x26C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_06_FLEXIO1_D06 0x028 0x26C 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_06_GPIO7_IO06 0x028 0x26C 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_07_GPIO7_IO07 0x02C 0x270 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_07_SEMC_DATA07 0x02C 0x270 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_07_FLEXPWM2_PWM0_B 0x02C 0x270 0x524 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_07_GPIO_MUX1_IO07 0x02C 0x270 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_07_FLEXIO1_D07 0x02C 0x270 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_08_SEMC_DM00 0x030 0x274 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_08_FLEXPWM2_PWM1_A 0x030 0x274 0x51C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_08_GPIO_MUX1_IO08 0x030 0x274 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_08_FLEXIO1_D08 0x030 0x274 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_08_GPIO7_IO08 0x030 0x274 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_09_SEMC_ADDR00 0x034 0x278 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_09_FLEXPWM2_PWM1_B 0x034 0x278 0x528 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_09_GPT5_CAPTURE1 0x034 0x278 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_09_GPIO_MUX1_IO09 0x034 0x278 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_09_FLEXIO1_D09 0x034 0x278 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_09_GPIO7_IO09 0x034 0x278 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_10_SEMC_ADDR01 0x038 0x27C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_10_FLEXPWM2_PWM2_A 0x038 0x27C 0x520 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_10_GPT5_CAPTURE2 0x038 0x27C 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_10_GPIO_MUX1_IO10 0x038 0x27C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_10_FLEXIO1_D10 0x038 0x27C 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_10_GPIO7_IO10 0x038 0x27C 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_11_GPIO7_IO11 0x03C 0x280 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_11_SEMC_ADDR02 0x03C 0x280 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_11_FLEXPWM2_PWM2_B 0x03C 0x280 0x52C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_11_GPT5_COMPARE1 0x03C 0x280 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_11_GPIO_MUX1_IO11 0x03C 0x280 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_11_FLEXIO1_D11 0x03C 0x280 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_12_SEMC_ADDR03 0x040 0x284 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_12_XBAR1_INOUT04 0x040 0x284 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_12_GPT5_COMPARE2 0x040 0x284 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_12_GPIO_MUX1_IO12 0x040 0x284 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_12_FLEXIO1_D12 0x040 0x284 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_12_GPIO7_IO12 0x040 0x284 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_13_SEMC_ADDR04 0x044 0x288 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_13_XBAR1_INOUT05 0x044 0x288 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_13_GPT5_COMPARE3 0x044 0x288 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_13_GPIO_MUX1_IO13 0x044 0x288 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_13_FLEXIO1_D13 0x044 0x288 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_13_GPIO7_IO13 0x044 0x288 0 0xA 0

