hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B1_14_GPIO7_IO14 0x048 0x28C 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_14_SEMC_ADDR05 0x048 0x28C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_14_XBAR1_INOUT06 0x048 0x28C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_14_GPT5_CLK 0x048 0x28C 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_14_GPIO_MUX1_IO14 0x048 0x28C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_14_FLEXIO1_D14 0x048 0x28C 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_15_SEMC_ADDR06 0x04C 0x290 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_15_XBAR1_INOUT07 0x04C 0x290 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_15_GPIO_MUX1_IO15 0x04C 0x290 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_15_FLEXIO1_D15 0x04C 0x290 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_15_GPIO7_IO15 0x04C 0x290 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_16_SEMC_ADDR07 0x050 0x294 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_16_XBAR1_INOUT08 0x050 0x294 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_16_GPIO_MUX1_IO16 0x050 0x294 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_16_FLEXIO1_D16 0x050 0x294 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_16_GPIO7_IO16 0x050 0x294 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_17_GPIO7_IO17 0x054 0x298 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_17_SEMC_ADDR08 0x054 0x298 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_17_FLEXPWM4_PWM3_A 0x054 0x298 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_17_TMR1_TIMER0 0x054 0x298 0x63C 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_17_GPIO_MUX1_IO17 0x054 0x298 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_17_FLEXIO1_D17 0x054 0x298 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_18_SEMC_ADDR09 0x058 0x29C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_18_FLEXPWM4_PWM3_B 0x058 0x29C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_18_TMR2_TIMER0 0x058 0x29C 0x648 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_18_GPIO_MUX1_IO18 0x058 0x29C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_18_FLEXIO1_D18 0x058 0x29C 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_18_GPIO7_IO18 0x058 0x29C 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_19_SEMC_ADDR11 0x05C 0x2A0 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_19_FLEXPWM2_PWM3_A 0x05C 0x2A0 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_19_TMR3_TIMER0 0x05C 0x2A0 0x654 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_19_GPIO_MUX1_IO19 0x05C 0x2A0 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_19_FLEXIO1_D19 0x05C 0x2A0 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_19_GPIO7_IO19 0x05C 0x2A0 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_20_SEMC_ADDR12 0x060 0x2A4 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_20_FLEXPWM2_PWM3_B 0x060 0x2A4 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_20_TMR4_TIMER0 0x060 0x2A4 0x660 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_20_GPIO_MUX1_IO20 0x060 0x2A4 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_20_FLEXIO1_D20 0x060 0x2A4 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_20_GPIO7_IO20 0x060 0x2A4 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_21_GPIO7_IO21 0x064 0x2A8 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_21_SEMC_BA0 0x064 0x2A8 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_21_FLEXPWM3_PWM3_A 0x064 0x2A8 0x53C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_21_GPIO_MUX1_IO21 0x064 0x2A8 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_21_FLEXIO1_D21 0x064 0x2A8 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_22_GPIO7_IO22 0x068 0x2AC 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_22_SEMC_BA1 0x068 0x2AC 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_22_FLEXPWM3_PWM3_B 0x068 0x2AC 0x54C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_22_GPIO_MUX1_IO22 0x068 0x2AC 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_22_FLEXIO1_D22 0x068 0x2AC 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_23_SEMC_ADDR10 0x06C 0x2B0 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_23_FLEXPWM1_PWM0_A 0x06C 0x2B0 0x500 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_23_GPIO_MUX1_IO23 0x06C 0x2B0 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_23_FLEXIO1_D23 0x06C 0x2B0 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_23_GPIO7_IO23 0x06C 0x2B0 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_24_GPIO7_IO24 0x070 0x2B4 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_24_SEMC_CAS 0x070 0x2B4 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_24_FLEXPWM1_PWM0_B 0x070 0x2B4 0x50C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_24_GPIO_MUX1_IO24 0x070 0x2B4 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_24_FLEXIO1_D24 0x070 0x2B4 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_25_GPIO7_IO25 0x074 0x2B8 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_25_SEMC_RAS 0x074 0x2B8 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_25_FLEXPWM1_PWM1_A 0x074 0x2B8 0x504 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_25_GPIO_MUX1_IO25 0x074 0x2B8 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_25_FLEXIO1_D25 0x074 0x2B8 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_26_SEMC_CLK 0x078 0x2BC 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_26_FLEXPWM1_PWM1_B 0x078 0x2BC 0x510 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_26_GPIO_MUX1_IO26 0x078 0x2BC 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_26_FLEXIO1_D26 0x078 0x2BC 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_26_GPIO7_IO26 0x078 0x2BC 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_27_GPIO7_IO27 0x07C 0x2C0 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_27_SEMC_CKE 0x07C 0x2C0 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_27_FLEXPWM1_PWM2_A 0x07C 0x2C0 0x508 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_27_GPIO_MUX1_IO27 0x07C 0x2C0 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_27_FLEXIO1_D27 0x07C 0x2C0 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_28_GPIO7_IO28 0x080 0x2C4 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_28_SEMC_WE 0x080 0x2C4 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_28_FLEXPWM1_PWM2_B 0x080 0x2C4 0x514 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_28_GPIO_MUX1_IO28 0x080 0x2C4 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_28_FLEXIO1_D28 0x080 0x2C4 0 0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_29_SEMC_CS0 0x084 0x2C8 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_29_FLEXPWM3_PWM0_A 0x084 0x2C8 0x530 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_29_GPIO_MUX1_IO29 0x084 0x2C8 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_29_FLEXIO1_D29 0x084 0x2C8 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_29_GPIO7_IO29 0x084 0x2C8 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_30_SEMC_DATA08 0x088 0x2CC 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_30_FLEXPWM3_PWM0_B 0x088 0x2CC 0x540 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_30_GPIO_MUX1_IO30 0x088 0x2CC 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_30_FLEXIO1_D30 0x088 0x2CC 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_30_GPIO7_IO30 0x088 0x2CC 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_31_GPIO7_IO31 0x08C 0x2D0 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_31_SEMC_DATA09 0x08C 0x2D0 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_31_FLEXPWM3_PWM1_A 0x08C 0x2D0 0x534 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_31_GPIO_MUX1_IO31 0x08C 0x2D0 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_31_FLEXIO1_D31 0x08C 0x2D0 0 0x8 0

