hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B1_32_GPIO8_IO00 0x090 0x2D4 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_32_SEMC_DATA10 0x090 0x2D4 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_32_FLEXPWM3_PWM1_B 0x090 0x2D4 0x544 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_32_GPIO_MUX2_IO00 0x090 0x2D4 0 0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_33_SEMC_DATA11 0x094 0x2D8 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_33_FLEXPWM3_PWM2_A 0x094 0x2D8 0x538 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_33_GPIO_MUX2_IO01 0x094 0x2D8 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_33_GPIO8_IO01 0x094 0x2D8 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_34_GPIO8_IO02 0x098 0x2DC 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_34_SEMC_DATA12 0x098 0x2DC 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_34_FLEXPWM3_PWM2_B 0x098 0x2DC 0x548 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_34_GPIO_MUX2_IO02 0x098 0x2DC 0 0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_35_GPIO8_IO03 0x09C 0x2E0 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_35_SEMC_DATA13 0x09C 0x2E0 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_35_XBAR1_INOUT09 0x09C 0x2E0 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_35_GPIO_MUX2_IO03 0x09C 0x2E0 0 0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_36_SEMC_DATA14 0x0A0 0x2E4 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_36_XBAR1_INOUT10 0x0A0 0x2E4 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_36_GPIO_MUX2_IO04 0x0A0 0x2E4 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_36_GPIO8_IO04 0x0A0 0x2E4 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_37_GPIO8_IO05 0x0A4 0x2E8 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_37_SEMC_DATA15 0x0A4 0x2E8 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_37_XBAR1_INOUT11 0x0A4 0x2E8 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_37_GPIO_MUX2_IO05 0x0A4 0x2E8 0 0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_38_GPIO8_IO06 0x0A8 0x2EC 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_38_SEMC_DM01 0x0A8 0x2EC 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_38_FLEXPWM1_PWM3_A 0x0A8 0x2EC 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_38_TMR1_TIMER1 0x0A8 0x2EC 0x640 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_38_GPIO_MUX2_IO06 0x0A8 0x2EC 0 0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_39_SEMC_DQS 0x0AC 0x2F0 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_39_FLEXPWM1_PWM3_B 0x0AC 0x2F0 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_39_TMR2_TIMER1 0x0AC 0x2F0 0x64C 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_39_GPIO_MUX2_IO07 0x0AC 0x2F0 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_39_GPIO8_IO07 0x0AC 0x2F0 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_40_SEMC_RDY 0x0B0 0x2F4 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_40_XBAR1_INOUT12 0x0B0 0x2F4 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_40_MQS_RIGHT 0x0B0 0x2F4 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_40_LPUART6_TXD 0x0B0 0x2F4 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B1_40_GPIO_MUX2_IO08 0x0B0 0x2F4 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_40_ENET_1G_MDC 0x0B0 0x2F4 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B1_40_CCM_CLKO1 0x0B0 0x2F4 0 0x9 0
#define IMXRT_PAD_GPIO_EMC_B1_40_GPIO8_IO08 0x0B0 0x2F4 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_41_GPIO8_IO09 0x0B4 0x2F8 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_41_SEMC_CSX00 0x0B4 0x2F8 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_41_XBAR1_INOUT13 0x0B4 0x2F8 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_41_MQS_LEFT 0x0B4 0x2F8 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_41_LPUART6_RXD 0x0B4 0x2F8 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B1_41_FLEXSPI2_B_DATA07 0x0B4 0x2F8 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B1_41_GPIO_MUX2_IO09 0x0B4 0x2F8 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_41_ENET_1G_MDIO 0x0B4 0x2F8 0x4C8 0x7 0
#define IMXRT_PAD_GPIO_EMC_B1_41_CCM_CLKO2 0x0B4 0x2F8 0 0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_00_SEMC_DATA16 0x0B8 0x2FC 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_00_CCM_ENET_REF_CLK_25M 0x0B8 0x2FC 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_00_TMR3_TIMER1 0x0B8 0x2FC 0x658 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_00_LPUART6_CTS_B 0x0B8 0x2FC 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_00_FLEXSPI2_B_DATA06 0x0B8 0x2FC 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_00_GPIO_MUX2_IO10 0x0B8 0x2FC 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_00_XBAR1_INOUT20 0x0B8 0x2FC 0x6D8 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_00_ENET_QOS_1588_EVENT1_OUT 0x0B8 0x2FC 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_00_LPSPI1_SCK 0x0B8 0x2FC 0x5D0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_00_LPI2C2_SCL 0x0B8 0x2FC 0x5B4 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_00_GPIO8_IO10 0x0B8 0x2FC 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_00_FLEXPWM3_PWM0_A 0x0B8 0x2FC 0x530 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_01_SEMC_DATA17 0x0BC 0x300 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_01_USDHC2_CD_B 0x0BC 0x300 0x6D0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_01_TMR4_TIMER1 0x0BC 0x300 0x664 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_01_LPUART6_RTS_B 0x0BC 0x300 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_01_FLEXSPI2_B_DATA05 0x0BC 0x300 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_01_GPIO_MUX2_IO11 0x0BC 0x300 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_01_XBAR1_INOUT21 0x0BC 0x300 0x6DC 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_01_ENET_QOS_1588_EVENT1_IN 0x0BC 0x300 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_01_LPSPI1_PCS0 0x0BC 0x300 0x5CC 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_01_LPI2C2_SDA 0x0BC 0x300 0x5B8 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_01_GPIO8_IO11 0x0BC 0x300 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_01_FLEXPWM3_PWM0_B 0x0BC 0x300 0x540 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_02_SEMC_DATA18 0x0C0 0x304 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_02_USDHC2_WP 0x0C0 0x304 0x6D4 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_02_VIDEO_MUX_CSI_DATA23 0x0C0 0x304 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_02_FLEXSPI2_B_DATA04 0x0C0 0x304 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_02_GPIO_MUX2_IO12 0x0C0 0x304 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_02_XBAR1_INOUT22 0x0C0 0x304 0x6E0 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_02_ENET_QOS_1588_EVENT1_AUX_IN 0x0C0 0x304 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_02_LPSPI1_SOUT 0x0C0 0x304 0x5D8 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_02_GPIO8_IO12 0x0C0 0x304 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_02_FLEXPWM3_PWM1_A 0x0C0 0x304 0x534 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_03_SEMC_DATA19 0x0C4 0x308 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_03_USDHC2_VSELECT 0x0C4 0x308 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_03_VIDEO_MUX_CSI_DATA22 0x0C4 0x308 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_03_FLEXSPI2_B_DATA03 0x0C4 0x308 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_03_GPIO_MUX2_IO13 0x0C4 0x308 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_03_XBAR1_INOUT23 0x0C4 0x308 0x6E4 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_03_ENET_1G_TX_DATA03 0x0C4 0x308 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_03_LPSPI1_SIN 0x0C4 0x308 0x5D4 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_03_GPIO8_IO13 0x0C4 0x308 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_03_FLEXPWM3_PWM1_B 0x0C4 0x308 0x544 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_04_SEMC_DATA20 0x0C8 0x30C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_04_USDHC2_RESET_B 0x0C8 0x30C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_04_SAI2_MCLK 0x0C8 0x30C 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_04_VIDEO_MUX_CSI_DATA21 0x0C8 0x30C 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_04_FLEXSPI2_B_DATA02 0x0C8 0x30C 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_04_GPIO_MUX2_IO14 0x0C8 0x30C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_04_XBAR1_INOUT24 0x0C8 0x30C 0x6E8 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_04_ENET_1G_TX_DATA02 0x0C8 0x30C 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_04_LPSPI3_SCK 0x0C8 0x30C 0x600 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_04_GPIO8_IO14 0x0C8 0x30C 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_04_FLEXPWM3_PWM2_A 0x0C8 0x30C 0x538 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_05_SEMC_DATA21 0x0CC 0x310 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_05_GPT3_CLK 0x0CC 0x310 0x598 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_05_SAI2_RX_SYNC 0x0CC 0x310 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_05_VIDEO_MUX_CSI_DATA20 0x0CC 0x310 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_05_FLEXSPI2_B_DATA01 0x0CC 0x310 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_05_GPIO_MUX2_IO15 0x0CC 0x310 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_05_XBAR1_INOUT25 0x0CC 0x310 0x6EC 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_05_ENET_1G_RX_CLK 0x0CC 0x310 0x4CC 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_05_LPSPI3_PCS0 0x0CC 0x310 0x5F0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_05_PIT1_TRIGGER0 0x0CC 0x310 0 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_05_GPIO8_IO15 0x0CC 0x310 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_05_FLEXPWM3_PWM2_B 0x0CC 0x310 0x548 0xB 1

