hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B2_06_SEMC_DATA22 0x0D0 0x314 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_06_GPT3_CAPTURE1 0x0D0 0x314 0x590 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_06_GPIO8_IO16 0x0D0 0x314 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_06_SAI2_RX_BCLK 0x0D0 0x314 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_06_FLEXPWM3_PWM3_A 0x0D0 0x314 0x53C 0xB 1
#define IMXRT_PAD_GPIO_EMC_B2_06_VIDEO_MUX_CSI_DATA19 0x0D0 0x314 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_06_FLEXSPI2_B_DATA00 0x0D0 0x314 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_06_GPIO_MUX2_IO16 0x0D0 0x314 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_06_XBAR1_INOUT26 0x0D0 0x314 0x6F0 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_06_ENET_1G_TX_ER 0x0D0 0x314 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_06_LPSPI3_SOUT 0x0D0 0x314 0x608 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_06_PIT1_TRIGGER1 0x0D0 0x314 0 0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_07_SEMC_DATA23 0x0D4 0x318 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_07_GPT3_CAPTURE2 0x0D4 0x318 0x594 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_07_SAI2_RX_DATA 0x0D4 0x318 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_07_VIDEO_MUX_CSI_DATA18 0x0D4 0x318 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_07_FLEXSPI2_B_DQS 0x0D4 0x318 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_07_GPIO_MUX2_IO17 0x0D4 0x318 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_07_XBAR1_INOUT27 0x0D4 0x318 0x6F4 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_07_ENET_1G_RX_DATA03 0x0D4 0x318 0x4DC 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_07_LPSPI3_SIN 0x0D4 0x318 0x604 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_07_PIT1_TRIGGER2 0x0D4 0x318 0 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_07_GPIO8_IO17 0x0D4 0x318 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_07_FLEXPWM3_PWM3_B 0x0D4 0x318 0x54C 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_08_SEMC_DM02 0x0D8 0x31C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_08_GPT3_COMPARE1 0x0D8 0x31C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_08_SAI2_TX_DATA 0x0D8 0x31C 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_08_VIDEO_MUX_CSI_DATA17 0x0D8 0x31C 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_08_FLEXSPI2_B_SS0_B 0x0D8 0x31C 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_08_GPIO_MUX2_IO18 0x0D8 0x31C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_08_XBAR1_INOUT28 0x0D8 0x31C 0x6F8 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_08_ENET_1G_RX_DATA02 0x0D8 0x31C 0x4D8 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_08_LPSPI3_PCS1 0x0D8 0x31C 0x5F4 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_08_PIT1_TRIGGER3 0x0D8 0x31C 0 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_08_GPIO8_IO18 0x0D8 0x31C 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_09_GPIO8_IO19 0x0DC 0x320 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_09_SEMC_DATA24 0x0DC 0x320 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_09_GPT3_COMPARE2 0x0DC 0x320 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_09_SAI2_TX_BCLK 0x0DC 0x320 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_09_VIDEO_MUX_CSI_DATA16 0x0DC 0x320 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_09_FLEXSPI2_B_SCLK 0x0DC 0x320 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_09_GPIO_MUX2_IO19 0x0DC 0x320 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_09_XBAR1_INOUT29 0x0DC 0x320 0x6FC 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_09_ENET_1G_CRS 0x0DC 0x320 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_09_LPSPI3_PCS2 0x0DC 0x320 0x5F8 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_09_TMR1_TIMER0 0x0DC 0x320 0x63C 0x9 1

#define IMXRT_PAD_GPIO_EMC_B2_10_GPIO8_IO20 0x0E0 0x324 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_10_SEMC_DATA25 0x0E0 0x324 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_10_GPT3_COMPARE3 0x0E0 0x324 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_10_SAI2_TX_SYNC 0x0E0 0x324 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_10_VIDEO_MUX_CSI_FIELD 0x0E0 0x324 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_10_FLEXSPI2_A_SCLK 0x0E0 0x324 0x58C 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_10_GPIO_MUX2_IO20 0x0E0 0x324 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_10_XBAR1_INOUT30 0x0E0 0x324 0x700 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_10_ENET_1G_COL 0x0E0 0x324 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_10_LPSPI3_PCS3 0x0E0 0x324 0x5FC 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_10_TMR1_TIMER1 0x0E0 0x324 0x640 0x9 1

#define IMXRT_PAD_GPIO_EMC_B2_11_SEMC_DATA26 0x0E4 0x328 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_11_SPDIF_IN 0x0E4 0x328 0x6B4 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_11_ENET_1G_TX_DATA00 0x0E4 0x328 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_11_SAI3_RX_SYNC 0x0E4 0x328 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_11_FLEXSPI2_A_SS0_B 0x0E4 0x328 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_11_GPIO_MUX2_IO21 0x0E4 0x328 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_11_XBAR1_INOUT31 0x0E4 0x328 0x704 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_11_EMVSIM1_IO 0x0E4 0x328 0x69C 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_11_TMR1_TIMER2 0x0E4 0x328 0x644 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_11_GPIO8_IO21 0x0E4 0x328 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_12_SEMC_DATA27 0x0E8 0x32C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_12_SPDIF_OUT 0x0E8 0x32C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_12_ENET_1G_TX_DATA01 0x0E8 0x32C 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_12_SAI3_RX_BCLK 0x0E8 0x32C 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_12_FLEXSPI2_A_DQS 0x0E8 0x32C 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_12_GPIO_MUX2_IO22 0x0E8 0x32C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_12_XBAR1_INOUT32 0x0E8 0x32C 0x708 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_12_EMVSIM1_CLK 0x0E8 0x32C 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_12_TMR1_TIMER3 0x0E8 0x32C 0 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_12_GPIO8_IO22 0x0E8 0x32C 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_13_GPIO8_IO23 0x0EC 0x330 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_13_SEMC_DATA28 0x0EC 0x330 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_13_ENET_1G_TX_EN 0x0EC 0x330 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_13_SAI3_RX_DATA 0x0EC 0x330 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_13_FLEXSPI2_A_DATA00 0x0EC 0x330 0x57C 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_13_GPIO_MUX2_IO23 0x0EC 0x330 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_13_XBAR1_INOUT33 0x0EC 0x330 0x70C 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_13_EMVSIM1_RST 0x0EC 0x330 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_13_TMR2_TIMER0 0x0EC 0x330 0x648 0x9 1

#define IMXRT_PAD_GPIO_EMC_B2_14_SEMC_DATA29 0x0F0 0x334 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_14_ENET_1G_TX_CLK_IO 0x0F0 0x334 0x4E8 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_14_SAI3_TX_DATA 0x0F0 0x334 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_14_FLEXSPI2_A_DATA01 0x0F0 0x334 0x580 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_14_GPIO_MUX2_IO24 0x0F0 0x334 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_14_XBAR1_INOUT34 0x0F0 0x334 0x710 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_14_SFA_ipp_do_atx_clk_under_test 0x0F0 0x334 0 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_14_EMVSIM1_SVEN 0x0F0 0x334 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_14_TMR2_TIMER1 0x0F0 0x334 0x64C 0x9 1
#define IMXRT_PAD_GPIO_EMC_B2_14_GPIO8_IO24 0x0F0 0x334 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_15_SEMC_DATA30 0x0F4 0x338 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_15_ENET_1G_RX_DATA00 0x0F4 0x338 0x4D0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_15_SAI3_TX_BCLK 0x0F4 0x338 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_15_FLEXSPI2_A_DATA02 0x0F4 0x338 0x584 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_15_GPIO_MUX2_IO25 0x0F4 0x338 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_15_XBAR1_INOUT35 0x0F4 0x338 0x714 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_15_EMVSIM1_PD 0x0F4 0x338 0x6A0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_15_TMR2_TIMER2 0x0F4 0x338 0x650 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_15_GPIO8_IO25 0x0F4 0x338 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_16_GPIO8_IO26 0x0F8 0x33C 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_16_SEMC_DATA31 0x0F8 0x33C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_16_XBAR1_INOUT14 0x0F8 0x33C 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_16_ENET_1G_RX_DATA01 0x0F8 0x33C 0x4D4 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_16_SAI3_TX_SYNC 0x0F8 0x33C 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_16_FLEXSPI2_A_DATA03 0x0F8 0x33C 0x588 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_16_GPIO_MUX2_IO26 0x0F8 0x33C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_16_EMVSIM1_POWER_FAIL 0x0F8 0x33C 0x6A4 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_16_TMR2_TIMER3 0x0F8 0x33C 0 0x9 0

