hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B2_17_SEMC_DM03 0x0FC 0x340 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_17_XBAR1_INOUT15 0x0FC 0x340 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_17_ENET_1G_RX_EN 0x0FC 0x340 0x4E0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_17_SAI3_MCLK 0x0FC 0x340 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_17_FLEXSPI2_A_DATA04 0x0FC 0x340 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_17_GPIO_MUX2_IO27 0x0FC 0x340 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_17_WDOG1_ANY 0x0FC 0x340 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_17_TMR3_TIMER0 0x0FC 0x340 0x654 0x9 1
#define IMXRT_PAD_GPIO_EMC_B2_17_GPIO8_IO27 0x0FC 0x340 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_18_SEMC_DQS4 0x100 0x344 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_18_XBAR1_INOUT16 0x100 0x344 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_18_ENET_1G_RX_ER 0x100 0x344 0x4E4 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_18_EWM_OUT_B 0x100 0x344 0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_18_FLEXSPI2_A_DATA05 0x100 0x344 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_18_GPIO_MUX2_IO28 0x100 0x344 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_18_FLEXSPI1_A_DQS 0x100 0x344 0x550 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_18_WDOG1_B 0x100 0x344 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_18_TMR3_TIMER1 0x100 0x344 0x658 0x9 1
#define IMXRT_PAD_GPIO_EMC_B2_18_GPIO8_IO28 0x100 0x344 0 0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_19_GPIO8_IO29 0x104 0x348 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_19_SEMC_CLKX00 0x104 0x348 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_MDC 0x104 0x348 0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_1G_MDC 0x104 0x348 0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_1G_REF_CLK 0x104 0x348 0x4C4 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_19_FLEXSPI2_A_DATA06 0x104 0x348 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_19_GPIO_MUX2_IO29 0x104 0x348 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_QOS_MDC 0x104 0x348 0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_19_TMR3_TIMER2 0x104 0x348 0x65C 0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_20_GPIO8_IO30 0x108 0x34C 0 0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_20_SEMC_CLKX01 0x108 0x34C 0 0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_MDIO 0x108 0x34C 0x4AC 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_1G_MDIO 0x108 0x34C 0x4C8 0x2 1
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_QOS_REF_CLK 0x108 0x34C 0x4A0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_20_FLEXSPI2_A_DATA07 0x108 0x34C 0 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_20_GPIO_MUX2_IO30 0x108 0x34C 0 0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_QOS_MDIO 0x108 0x34C 0x4EC 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_20_TMR3_TIMER3 0x108 0x34C 0 0x9 0

#define IMXRT_PAD_GPIO_AD_00_GPIO8_IO31 0x10C 0x350 0 0xA 0
#define IMXRT_PAD_GPIO_AD_00_EMVSIM1_IO 0x10C 0x350 0x69C 0x0 1
#define IMXRT_PAD_GPIO_AD_00_FLEXCAN2_TX 0x10C 0x350 0 0x1 0
#define IMXRT_PAD_GPIO_AD_00_ENET_1G_1588_EVENT1_IN 0x10C 0x350 0 0x2 0
#define IMXRT_PAD_GPIO_AD_00_GPT2_CAPTURE1 0x10C 0x350 0 0x3 0
#define IMXRT_PAD_GPIO_AD_00_FLEXPWM1_PWM0_A 0x10C 0x350 0x500 0x4 1
#define IMXRT_PAD_GPIO_AD_00_GPIO_MUX2_IO31 0x10C 0x350 0 0x5 0
#define IMXRT_PAD_GPIO_AD_00_LPUART7_TXD 0x10C 0x350 0x630 0x6 0
#define IMXRT_PAD_GPIO_AD_00_FLEXIO2_D00 0x10C 0x350 0 0x8 0
#define IMXRT_PAD_GPIO_AD_00_FLEXSPI2_B_SS1_B 0x10C 0x350 0 0x9 0

#define IMXRT_PAD_GPIO_AD_01_GPIO9_IO00 0x110 0x354 0 0xA 0
#define IMXRT_PAD_GPIO_AD_01_EMVSIM1_CLK 0x110 0x354 0 0x0 0
#define IMXRT_PAD_GPIO_AD_01_FLEXCAN2_RX 0x110 0x354 0x49C 0x1 0
#define IMXRT_PAD_GPIO_AD_01_ENET_1G_1588_EVENT1_OUT 0x110 0x354 0 0x2 0
#define IMXRT_PAD_GPIO_AD_01_GPT2_CAPTURE2 0x110 0x354 0 0x3 0
#define IMXRT_PAD_GPIO_AD_01_FLEXPWM1_PWM0_B 0x110 0x354 0x50C 0x4 1
#define IMXRT_PAD_GPIO_AD_01_GPIO_MUX3_IO00 0x110 0x354 0 0x5 0
#define IMXRT_PAD_GPIO_AD_01_LPUART7_RXD 0x110 0x354 0x62C 0x6 0
#define IMXRT_PAD_GPIO_AD_01_FLEXIO2_D01 0x110 0x354 0 0x8 0
#define IMXRT_PAD_GPIO_AD_01_FLEXSPI2_A_SS1_B 0x110 0x354 0 0x9 0

#define IMXRT_PAD_GPIO_AD_02_GPIO9_IO01 0x114 0x358 0 0xA 0
#define IMXRT_PAD_GPIO_AD_02_EMVSIM1_RST 0x114 0x358 0 0x0 0
#define IMXRT_PAD_GPIO_AD_02_LPUART7_CTS_B 0x114 0x358 0 0x1 0
#define IMXRT_PAD_GPIO_AD_02_ENET_1G_1588_EVENT2_IN 0x114 0x358 0 0x2 0
#define IMXRT_PAD_GPIO_AD_02_GPT2_COMPARE1 0x114 0x358 0 0x3 0
#define IMXRT_PAD_GPIO_AD_02_FLEXPWM1_PWM1_A 0x114 0x358 0x504 0x4 1
#define IMXRT_PAD_GPIO_AD_02_GPIO_MUX3_IO01 0x114 0x358 0 0x5 0
#define IMXRT_PAD_GPIO_AD_02_LPUART8_TXD 0x114 0x358 0x638 0x6 0
#define IMXRT_PAD_GPIO_AD_02_FLEXIO2_D02 0x114 0x358 0 0x8 0
#define IMXRT_PAD_GPIO_AD_02_VIDEO_MUX_EXT_DCIC1 0x114 0x358 0 0x9 0

#define IMXRT_PAD_GPIO_AD_03_GPIO9_IO02 0x118 0x35C 0 0xA 0
#define IMXRT_PAD_GPIO_AD_03_EMVSIM1_SVEN 0x118 0x35C 0 0x0 0
#define IMXRT_PAD_GPIO_AD_03_LPUART7_RTS_B 0x118 0x35C 0 0x1 0
#define IMXRT_PAD_GPIO_AD_03_ENET_1G_1588_EVENT2_OUT 0x118 0x35C 0 0x2 0
#define IMXRT_PAD_GPIO_AD_03_GPT2_COMPARE2 0x118 0x35C 0 0x3 0
#define IMXRT_PAD_GPIO_AD_03_FLEXPWM1_PWM1_B 0x118 0x35C 0x510 0x4 1
#define IMXRT_PAD_GPIO_AD_03_GPIO_MUX3_IO02 0x118 0x35C 0 0x5 0
#define IMXRT_PAD_GPIO_AD_03_LPUART8_RXD 0x118 0x35C 0x634 0x6 0
#define IMXRT_PAD_GPIO_AD_03_FLEXIO2_D03 0x118 0x35C 0 0x8 0
#define IMXRT_PAD_GPIO_AD_03_VIDEO_MUX_EXT_DCIC2 0x118 0x35C 0 0x9 0

#define IMXRT_PAD_GPIO_AD_04_EMVSIM1_PD 0x11C 0x360 0x6A0 0x0 1
#define IMXRT_PAD_GPIO_AD_04_LPUART8_CTS_B 0x11C 0x360 0 0x1 0
#define IMXRT_PAD_GPIO_AD_04_ENET_1G_1588_EVENT3_IN 0x11C 0x360 0 0x2 0
#define IMXRT_PAD_GPIO_AD_04_GPT2_COMPARE3 0x11C 0x360 0 0x3 0
#define IMXRT_PAD_GPIO_AD_04_FLEXPWM1_PWM2_A 0x11C 0x360 0x508 0x4 1
#define IMXRT_PAD_GPIO_AD_04_GPIO_MUX3_IO03 0x11C 0x360 0 0x5 0
#define IMXRT_PAD_GPIO_AD_04_WDOG1_B 0x11C 0x360 0 0x6 0
#define IMXRT_PAD_GPIO_AD_04_FLEXIO2_D04 0x11C 0x360 0 0x8 0
#define IMXRT_PAD_GPIO_AD_04_TMR4_TIMER0 0x11C 0x360 0x660 0x9 1
#define IMXRT_PAD_GPIO_AD_04_GPIO9_IO03 0x11C 0x360 0 0xA 0

#define IMXRT_PAD_GPIO_AD_05_EMVSIM1_POWER_FAIL 0x120 0x364 0x6A4 0x0 1
#define IMXRT_PAD_GPIO_AD_05_LPUART8_RTS_B 0x120 0x364 0 0x1 0
#define IMXRT_PAD_GPIO_AD_05_ENET_1G_1588_EVENT3_OUT 0x120 0x364 0 0x2 0
#define IMXRT_PAD_GPIO_AD_05_GPT2_CLK 0x120 0x364 0 0x3 0
#define IMXRT_PAD_GPIO_AD_05_FLEXPWM1_PWM2_B 0x120 0x364 0x514 0x4 1
#define IMXRT_PAD_GPIO_AD_05_GPIO_MUX3_IO04 0x120 0x364 0 0x5 0
#define IMXRT_PAD_GPIO_AD_05_WDOG2_B 0x120 0x364 0 0x6 0
#define IMXRT_PAD_GPIO_AD_05_FLEXIO2_D05 0x120 0x364 0 0x8 0
#define IMXRT_PAD_GPIO_AD_05_TMR4_TIMER1 0x120 0x364 0x664 0x9 1
#define IMXRT_PAD_GPIO_AD_05_GPIO9_IO04 0x120 0x364 0 0xA 0

#define IMXRT_PAD_GPIO_AD_06_USB_OTG2_OC 0x124 0x368 0x6B8 0x0 0
#define IMXRT_PAD_GPIO_AD_06_FLEXCAN1_TX 0x124 0x368 0 0x1 0
#define IMXRT_PAD_GPIO_AD_06_EMVSIM2_IO 0x124 0x368 0x6A8 0x2 0
#define IMXRT_PAD_GPIO_AD_06_GPT3_CAPTURE1 0x124 0x368 0x590 0x3 1
#define IMXRT_PAD_GPIO_AD_06_VIDEO_MUX_CSI_DATA15 0x124 0x368 0 0x4 0
#define IMXRT_PAD_GPIO_AD_06_GPIO_MUX3_IO05 0x124 0x368 0 0x5 0
#define IMXRT_PAD_GPIO_AD_06_ENET_1588_EVENT1_IN 0x124 0x368 0 0x6 0
#define IMXRT_PAD_GPIO_AD_06_FLEXIO2_D06 0x124 0x368 0 0x8 0
#define IMXRT_PAD_GPIO_AD_06_TMR4_TIMER2 0x124 0x368 0x668 0x9 0
#define IMXRT_PAD_GPIO_AD_06_GPIO9_IO05 0x124 0x368 0 0xA 0
#define IMXRT_PAD_GPIO_AD_06_FLEXPWM1_PWM0_X 0x124 0x368 0 0xB 0

#define IMXRT_PAD_GPIO_AD_07_USB_OTG2_PWR 0x128 0x36C 0 0x0 0
#define IMXRT_PAD_GPIO_AD_07_FLEXCAN1_RX 0x128 0x36C 0x498 0x1 0
#define IMXRT_PAD_GPIO_AD_07_EMVSIM2_CLK 0x128 0x36C 0 0x2 0
#define IMXRT_PAD_GPIO_AD_07_GPT3_CAPTURE2 0x128 0x36C 0x594 0x3 1
#define IMXRT_PAD_GPIO_AD_07_VIDEO_MUX_CSI_DATA14 0x128 0x36C 0 0x4 0
#define IMXRT_PAD_GPIO_AD_07_GPIO_MUX3_IO06 0x128 0x36C 0 0x5 0
#define IMXRT_PAD_GPIO_AD_07_ENET_1588_EVENT1_OUT 0x128 0x36C 0 0x6 0
#define IMXRT_PAD_GPIO_AD_07_FLEXIO2_D07 0x128 0x36C 0 0x8 0
#define IMXRT_PAD_GPIO_AD_07_TMR4_TIMER3 0x128 0x36C 0 0x9 0
#define IMXRT_PAD_GPIO_AD_07_GPIO9_IO06 0x128 0x36C 0 0xA 0
#define IMXRT_PAD_GPIO_AD_07_FLEXPWM1_PWM1_X 0x128 0x36C 0 0xB 0

#define IMXRT_PAD_GPIO_AD_08_USBPHY2_OTG_ID 0x12C 0x370 0x6C4 0x0 0
#define IMXRT_PAD_GPIO_AD_08_LPI2C1_SCL 0x12C 0x370 0x5AC 0x1 0
#define IMXRT_PAD_GPIO_AD_08_EMVSIM2_RST 0x12C 0x370 0 0x2 0
#define IMXRT_PAD_GPIO_AD_08_GPT3_COMPARE1 0x12C 0x370 0 0x3 0
#define IMXRT_PAD_GPIO_AD_08_VIDEO_MUX_CSI_DATA13 0x12C 0x370 0 0x4 0
#define IMXRT_PAD_GPIO_AD_08_GPIO_MUX3_IO07 0x12C 0x370 0 0x5 0
#define IMXRT_PAD_GPIO_AD_08_ENET_1588_EVENT2_IN 0x12C 0x370 0 0x6 0
#define IMXRT_PAD_GPIO_AD_08_FLEXIO2_D08 0x12C 0x370 0 0x8 0
#define IMXRT_PAD_GPIO_AD_08_GPIO9_IO07 0x12C 0x370 0 0xA 0
#define IMXRT_PAD_GPIO_AD_08_FLEXPWM1_PWM2_X 0x12C 0x370 0 0xB 0

#define IMXRT_PAD_GPIO_AD_09_USBPHY1_OTG_ID 0x130 0x374 0x6C0 0x0 0
#define IMXRT_PAD_GPIO_AD_09_LPI2C1_SDA 0x130 0x374 0x5B0 0x1 0
#define IMXRT_PAD_GPIO_AD_09_EMVSIM2_SVEN 0x130 0x374 0 0x2 0
#define IMXRT_PAD_GPIO_AD_09_GPT3_COMPARE2 0x130 0x374 0 0x3 0
#define IMXRT_PAD_GPIO_AD_09_VIDEO_MUX_CSI_DATA12 0x130 0x374 0 0x4 0
#define IMXRT_PAD_GPIO_AD_09_GPIO_MUX3_IO08 0x130 0x374 0 0x5 0
#define IMXRT_PAD_GPIO_AD_09_ENET_1588_EVENT2_OUT 0x130 0x374 0 0x6 0
#define IMXRT_PAD_GPIO_AD_09_FLEXIO2_D09 0x130 0x374 0 0x8 0
#define IMXRT_PAD_GPIO_AD_09_GPIO9_IO08 0x130 0x374 0 0xA 0
#define IMXRT_PAD_GPIO_AD_09_FLEXPWM1_PWM3_X 0x130 0x374 0 0xB 0

#define IMXRT_PAD_GPIO_AD_10_USB_OTG1_PWR 0x134 0x378 0 0x0 0
#define IMXRT_PAD_GPIO_AD_10_LPI2C1_SCLS 0x134 0x378 0 0x1 0
#define IMXRT_PAD_GPIO_AD_10_EMVSIM2_PD 0x134 0x378 0x6AC 0x2 0
#define IMXRT_PAD_GPIO_AD_10_GPT3_COMPARE3 0x134 0x378 0 0x3 0
#define IMXRT_PAD_GPIO_AD_10_VIDEO_MUX_CSI_DATA11 0x134 0x378 0 0x4 0
#define IMXRT_PAD_GPIO_AD_10_GPIO_MUX3_IO09 0x134 0x378 0 0x5 0
#define IMXRT_PAD_GPIO_AD_10_ENET_1588_EVENT3_IN 0x134 0x378 0 0x6 0
#define IMXRT_PAD_GPIO_AD_10_FLEXIO2_D10 0x134 0x378 0 0x8 0
#define IMXRT_PAD_GPIO_AD_10_GPIO9_IO09 0x134 0x378 0 0xA 0
#define IMXRT_PAD_GPIO_AD_10_FLEXPWM2_PWM0_X 0x134 0x378 0 0xB 0

#define IMXRT_PAD_GPIO_AD_11_USB_OTG1_OC 0x138 0x37C 0x6BC 0x0 0
#define IMXRT_PAD_GPIO_AD_11_LPI2C1_SDAS 0x138 0x37C 0 0x1 0
#define IMXRT_PAD_GPIO_AD_11_EMVSIM2_POWER_FAIL 0x138 0x37C 0x6B0 0x2 0
#define IMXRT_PAD_GPIO_AD_11_GPT3_CLK 0x138 0x37C 0x598 0x3 1
#define IMXRT_PAD_GPIO_AD_11_VIDEO_MUX_CSI_DATA10 0x138 0x37C 0 0x4 0
#define IMXRT_PAD_GPIO_AD_11_GPIO_MUX3_IO10 0x138 0x37C 0 0x5 0
#define IMXRT_PAD_GPIO_AD_11_ENET_1588_EVENT3_OUT 0x138 0x37C 0 0x6 0
#define IMXRT_PAD_GPIO_AD_11_FLEXIO2_D11 0x138 0x37C 0 0x8 0
#define IMXRT_PAD_GPIO_AD_11_GPIO9_IO10 0x138 0x37C 0 0xA 0
#define IMXRT_PAD_GPIO_AD_11_FLEXPWM2_PWM1_X 0x138 0x37C 0 0xB 0

