hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_AD_12_SPDIF_LOCK 0x13C 0x380 0 0x0 0
#define IMXRT_PAD_GPIO_AD_12_LPI2C1_HREQ 0x13C 0x380 0 0x1 0
#define IMXRT_PAD_GPIO_AD_12_GPT1_CAPTURE1 0x13C 0x380 0 0x2 0
#define IMXRT_PAD_GPIO_AD_12_FLEXSPI1_B_DATA03 0x13C 0x380 0x570 0x3 0
#define IMXRT_PAD_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK 0x13C 0x380 0 0x4 0
#define IMXRT_PAD_GPIO_AD_12_GPIO_MUX3_IO11 0x13C 0x380 0 0x5 0
#define IMXRT_PAD_GPIO_AD_12_ENET_TX_DATA03 0x13C 0x380 0 0x6 0
#define IMXRT_PAD_GPIO_AD_12_FLEXIO2_D12 0x13C 0x380 0 0x8 0
#define IMXRT_PAD_GPIO_AD_12_EWM_OUT_B 0x13C 0x380 0 0x9 0
#define IMXRT_PAD_GPIO_AD_12_GPIO9_IO11 0x13C 0x380 0 0xA 0
#define IMXRT_PAD_GPIO_AD_12_FLEXPWM2_PWM2_X 0x13C 0x380 0 0xB 0

#define IMXRT_PAD_GPIO_AD_13_SPDIF_SR_CLK 0x140 0x384 0 0x0 0
#define IMXRT_PAD_GPIO_AD_13_PIT1_TRIGGER0 0x140 0x384 0 0x1 0
#define IMXRT_PAD_GPIO_AD_13_GPT1_CAPTURE2 0x140 0x384 0 0x2 0
#define IMXRT_PAD_GPIO_AD_13_FLEXSPI1_B_DATA02 0x140 0x384 0x56C 0x3 0
#define IMXRT_PAD_GPIO_AD_13_VIDEO_MUX_CSI_MCLK 0x140 0x384 0 0x4 0
#define IMXRT_PAD_GPIO_AD_13_GPIO_MUX3_IO12 0x140 0x384 0 0x5 0
#define IMXRT_PAD_GPIO_AD_13_ENET_TX_DATA02 0x140 0x384 0 0x6 0
#define IMXRT_PAD_GPIO_AD_13_FLEXIO2_D13 0x140 0x384 0 0x8 0
#define IMXRT_PAD_GPIO_AD_13_REF_CLK_32K 0x140 0x384 0 0x9 0
#define IMXRT_PAD_GPIO_AD_13_GPIO9_IO12 0x140 0x384 0 0xA 0
#define IMXRT_PAD_GPIO_AD_13_FLEXPWM2_PWM3_X 0x140 0x384 0 0xB 0

#define IMXRT_PAD_GPIO_AD_14_SPDIF_EXT_CLK 0x144 0x388 0 0x0 0
#define IMXRT_PAD_GPIO_AD_14_REF_CLK_24M 0x144 0x388 0 0x1 0
#define IMXRT_PAD_GPIO_AD_14_GPT1_COMPARE1 0x144 0x388 0 0x2 0
#define IMXRT_PAD_GPIO_AD_14_FLEXSPI1_B_DATA01 0x144 0x388 0x568 0x3 0
#define IMXRT_PAD_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC 0x144 0x388 0 0x4 0
#define IMXRT_PAD_GPIO_AD_14_GPIO_MUX3_IO13 0x144 0x388 0 0x5 0
#define IMXRT_PAD_GPIO_AD_14_ENET_RX_CLK 0x144 0x388 0 0x6 0
#define IMXRT_PAD_GPIO_AD_14_FLEXIO2_D14 0x144 0x388 0 0x8 0
#define IMXRT_PAD_GPIO_AD_14_CCM_ENET_REF_CLK_25M 0x144 0x388 0 0x9 0
#define IMXRT_PAD_GPIO_AD_14_GPIO9_IO13 0x144 0x388 0 0xA 0
#define IMXRT_PAD_GPIO_AD_14_FLEXPWM3_PWM0_X 0x144 0x388 0 0xB 0

#define IMXRT_PAD_GPIO_AD_15_GPIO9_IO14 0x148 0x38C 0 0xA 0
#define IMXRT_PAD_GPIO_AD_15_FLEXPWM3_PWM1_X 0x148 0x38C 0 0xB 0
#define IMXRT_PAD_GPIO_AD_15_SPDIF_IN 0x148 0x38C 0x6B4 0x0 1
#define IMXRT_PAD_GPIO_AD_15_LPUART10_TXD 0x148 0x38C 0x628 0x1 0
#define IMXRT_PAD_GPIO_AD_15_GPT1_COMPARE2 0x148 0x38C 0 0x2 0
#define IMXRT_PAD_GPIO_AD_15_FLEXSPI1_B_DATA00 0x148 0x38C 0x564 0x3 0
#define IMXRT_PAD_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC 0x148 0x38C 0 0x4 0
#define IMXRT_PAD_GPIO_AD_15_GPIO_MUX3_IO14 0x148 0x38C 0 0x5 0
#define IMXRT_PAD_GPIO_AD_15_ENET_TX_ER 0x148 0x38C 0 0x6 0
#define IMXRT_PAD_GPIO_AD_15_FLEXIO2_D15 0x148 0x38C 0 0x8 0

#define IMXRT_PAD_GPIO_AD_16_SPDIF_OUT 0x14C 0x390 0 0x0 0
#define IMXRT_PAD_GPIO_AD_16_LPUART10_RXD 0x14C 0x390 0x624 0x1 0
#define IMXRT_PAD_GPIO_AD_16_GPT1_COMPARE3 0x14C 0x390 0 0x2 0
#define IMXRT_PAD_GPIO_AD_16_FLEXSPI1_B_SCLK 0x14C 0x390 0x578 0x3 0
#define IMXRT_PAD_GPIO_AD_16_VIDEO_MUX_CSI_DATA09 0x14C 0x390 0 0x4 0
#define IMXRT_PAD_GPIO_AD_16_GPIO_MUX3_IO15 0x14C 0x390 0 0x5 0
#define IMXRT_PAD_GPIO_AD_16_ENET_RX_DATA03 0x14C 0x390 0 0x6 0
#define IMXRT_PAD_GPIO_AD_16_FLEXIO2_D16 0x14C 0x390 0 0x8 0
#define IMXRT_PAD_GPIO_AD_16_ENET_1G_MDC 0x14C 0x390 0 0x9 0
#define IMXRT_PAD_GPIO_AD_16_GPIO9_IO15 0x14C 0x390 0 0xA 0
#define IMXRT_PAD_GPIO_AD_16_FLEXPWM3_PWM2_X 0x14C 0x390 0 0xB 0

#define IMXRT_PAD_GPIO_AD_17_SAI1_MCLK 0x150 0x394 0x66C 0x0 0
#define IMXRT_PAD_GPIO_AD_17_ACMP1_OUT 0x150 0x394 0 0x1 0
#define IMXRT_PAD_GPIO_AD_17_GPT1_CLK 0x150 0x394 0 0x2 0
#define IMXRT_PAD_GPIO_AD_17_FLEXSPI1_A_DQS 0x150 0x394 0x550 0x3 1
#define IMXRT_PAD_GPIO_AD_17_VIDEO_MUX_CSI_DATA08 0x150 0x394 0 0x4 0
#define IMXRT_PAD_GPIO_AD_17_GPIO_MUX3_IO16 0x150 0x394 0 0x5 0
#define IMXRT_PAD_GPIO_AD_17_ENET_RX_DATA02 0x150 0x394 0 0x6 0
#define IMXRT_PAD_GPIO_AD_17_FLEXIO2_D17 0x150 0x394 0 0x8 0
#define IMXRT_PAD_GPIO_AD_17_ENET_1G_MDIO 0x150 0x394 0x4C8 0x9 2
#define IMXRT_PAD_GPIO_AD_17_GPIO9_IO16 0x150 0x394 0 0xA 0
#define IMXRT_PAD_GPIO_AD_17_FLEXPWM3_PWM3_X 0x150 0x394 0 0xB 0

#define IMXRT_PAD_GPIO_AD_18_GPIO9_IO17 0x154 0x398 0 0xA 0
#define IMXRT_PAD_GPIO_AD_18_FLEXPWM4_PWM0_X 0x154 0x398 0 0xB 0
#define IMXRT_PAD_GPIO_AD_18_SAI1_RX_SYNC 0x154 0x398 0x678 0x0 0
#define IMXRT_PAD_GPIO_AD_18_ACMP2_OUT 0x154 0x398 0 0x1 0
#define IMXRT_PAD_GPIO_AD_18_LPSPI1_PCS1 0x154 0x398 0 0x2 0
#define IMXRT_PAD_GPIO_AD_18_FLEXSPI1_A_SS0_B 0x154 0x398 0 0x3 0
#define IMXRT_PAD_GPIO_AD_18_VIDEO_MUX_CSI_DATA07 0x154 0x398 0 0x4 0
#define IMXRT_PAD_GPIO_AD_18_GPIO_MUX3_IO17 0x154 0x398 0 0x5 0
#define IMXRT_PAD_GPIO_AD_18_ENET_CRS 0x154 0x398 0 0x6 0
#define IMXRT_PAD_GPIO_AD_18_FLEXIO2_D18 0x154 0x398 0 0x8 0
#define IMXRT_PAD_GPIO_AD_18_LPI2C2_SCL 0x154 0x398 0x5B4 0x9 1

#define IMXRT_PAD_GPIO_AD_19_SAI1_RX_BCLK 0x158 0x39C 0x670 0x0 0
#define IMXRT_PAD_GPIO_AD_19_ACMP3_OUT 0x158 0x39C 0 0x1 0
#define IMXRT_PAD_GPIO_AD_19_LPSPI1_PCS2 0x158 0x39C 0 0x2 0
#define IMXRT_PAD_GPIO_AD_19_FLEXSPI1_A_SCLK 0x158 0x39C 0x574 0x3 0
#define IMXRT_PAD_GPIO_AD_19_VIDEO_MUX_CSI_DATA06 0x158 0x39C 0 0x4 0
#define IMXRT_PAD_GPIO_AD_19_GPIO_MUX3_IO18 0x158 0x39C 0 0x5 0
#define IMXRT_PAD_GPIO_AD_19_ENET_COL 0x158 0x39C 0 0x6 0
#define IMXRT_PAD_GPIO_AD_19_FLEXIO2_D19 0x158 0x39C 0 0x8 0
#define IMXRT_PAD_GPIO_AD_19_LPI2C2_SDA 0x158 0x39C 0x5B8 0x9 1
#define IMXRT_PAD_GPIO_AD_19_GPIO9_IO18 0x158 0x39C 0 0xA 0
#define IMXRT_PAD_GPIO_AD_19_FLEXPWM4_PWM1_X 0x158 0x39C 0 0xB 0

#define IMXRT_PAD_GPIO_AD_20_SAI1_RX_DATA00 0x15C 0x3A0 0x674 0x0 0
#define IMXRT_PAD_GPIO_AD_20_ACMP4_OUT 0x15C 0x3A0 0 0x1 0
#define IMXRT_PAD_GPIO_AD_20_LPSPI1_PCS3 0x15C 0x3A0 0 0x2 0
#define IMXRT_PAD_GPIO_AD_20_FLEXSPI1_A_DATA00 0x15C 0x3A0 0x554 0x3 0
#define IMXRT_PAD_GPIO_AD_20_VIDEO_MUX_CSI_DATA05 0x15C 0x3A0 0 0x4 0
#define IMXRT_PAD_GPIO_AD_20_GPIO_MUX3_IO19 0x15C 0x3A0 0 0x5 0
#define IMXRT_PAD_GPIO_AD_20_KPP_ROW07 0x15C 0x3A0 0x5A8 0x6 0
#define IMXRT_PAD_GPIO_AD_20_FLEXIO2_D20 0x15C 0x3A0 0 0x8 0
#define IMXRT_PAD_GPIO_AD_20_ENET_QOS_1588_EVENT2_OUT 0x15C 0x3A0 0 0x9 0
#define IMXRT_PAD_GPIO_AD_20_GPIO9_IO19 0x15C 0x3A0 0 0xA 0
#define IMXRT_PAD_GPIO_AD_20_FLEXPWM4_PWM2_X 0x15C 0x3A0 0 0xB 0

#define IMXRT_PAD_GPIO_AD_21_SAI1_TX_DATA00 0x160 0x3A4 0 0x0 0
#define IMXRT_PAD_GPIO_AD_21_LPSPI2_PCS1 0x160 0x3A4 0x5E0 0x2 0
#define IMXRT_PAD_GPIO_AD_21_FLEXSPI1_A_DATA01 0x160 0x3A4 0x558 0x3 0
#define IMXRT_PAD_GPIO_AD_21_VIDEO_MUX_CSI_DATA04 0x160 0x3A4 0 0x4 0
#define IMXRT_PAD_GPIO_AD_21_GPIO_MUX3_IO20 0x160 0x3A4 0 0x5 0
#define IMXRT_PAD_GPIO_AD_21_KPP_COL07 0x160 0x3A4 0x5A0 0x6 0
#define IMXRT_PAD_GPIO_AD_21_FLEXIO2_D21 0x160 0x3A4 0 0x8 0
#define IMXRT_PAD_GPIO_AD_21_ENET_QOS_1588_EVENT2_IN 0x160 0x3A4 0 0x9 0
#define IMXRT_PAD_GPIO_AD_21_GPIO9_IO20 0x160 0x3A4 0 0xA 0
#define IMXRT_PAD_GPIO_AD_21_FLEXPWM4_PWM3_X 0x160 0x3A4 0 0xB 0

#define IMXRT_PAD_GPIO_AD_22_GPIO9_IO21 0x164 0x3A8 0 0xA 0
#define IMXRT_PAD_GPIO_AD_22_SAI1_TX_BCLK 0x164 0x3A8 0x67C 0x0 0
#define IMXRT_PAD_GPIO_AD_22_LPSPI2_PCS2 0x164 0x3A8 0 0x2 0
#define IMXRT_PAD_GPIO_AD_22_FLEXSPI1_A_DATA02 0x164 0x3A8 0x55C 0x3 0
#define IMXRT_PAD_GPIO_AD_22_VIDEO_MUX_CSI_DATA03 0x164 0x3A8 0 0x4 0
#define IMXRT_PAD_GPIO_AD_22_GPIO_MUX3_IO21 0x164 0x3A8 0 0x5 0
#define IMXRT_PAD_GPIO_AD_22_KPP_ROW06 0x164 0x3A8 0x5A4 0x6 0
#define IMXRT_PAD_GPIO_AD_22_FLEXIO2_D22 0x164 0x3A8 0 0x8 0
#define IMXRT_PAD_GPIO_AD_22_ENET_QOS_1588_EVENT3_OUT 0x164 0x3A8 0 0x9 0

#define IMXRT_PAD_GPIO_AD_23_SAI1_TX_SYNC 0x168 0x3AC 0x680 0x0 0
#define IMXRT_PAD_GPIO_AD_23_LPSPI2_PCS3 0x168 0x3AC 0 0x2 0
#define IMXRT_PAD_GPIO_AD_23_FLEXSPI1_A_DATA03 0x168 0x3AC 0x560 0x3 0
#define IMXRT_PAD_GPIO_AD_23_VIDEO_MUX_CSI_DATA02 0x168 0x3AC 0 0x4 0
#define IMXRT_PAD_GPIO_AD_23_GPIO_MUX3_IO22 0x168 0x3AC 0 0x5 0
#define IMXRT_PAD_GPIO_AD_23_KPP_COL06 0x168 0x3AC 0x59C 0x6 0
#define IMXRT_PAD_GPIO_AD_23_FLEXIO2_D23 0x168 0x3AC 0 0x8 0
#define IMXRT_PAD_GPIO_AD_23_ENET_QOS_1588_EVENT3_IN 0x168 0x3AC 0 0x9 0
#define IMXRT_PAD_GPIO_AD_23_GPIO9_IO22 0x168 0x3AC 0 0xA 0

#define IMXRT_PAD_GPIO_AD_24_LPUART1_TXD 0x16C 0x3B0 0x620 0x0 0
#define IMXRT_PAD_GPIO_AD_24_LPSPI2_SCK 0x16C 0x3B0 0x5E4 0x1 0
#define IMXRT_PAD_GPIO_AD_24_VIDEO_MUX_CSI_DATA00 0x16C 0x3B0 0 0x2 0
#define IMXRT_PAD_GPIO_AD_24_ENET_RX_EN 0x16C 0x3B0 0x4B8 0x3 0
#define IMXRT_PAD_GPIO_AD_24_FLEXPWM2_PWM0_A 0x16C 0x3B0 0x518 0x4 1
#define IMXRT_PAD_GPIO_AD_24_GPIO_MUX3_IO23 0x16C 0x3B0 0 0x5 0
#define IMXRT_PAD_GPIO_AD_24_KPP_ROW05 0x16C 0x3B0 0 0x6 0
#define IMXRT_PAD_GPIO_AD_24_FLEXIO2_D24 0x16C 0x3B0 0 0x8 0
#define IMXRT_PAD_GPIO_AD_24_LPI2C4_SCL 0x16C 0x3B0 0x5C4 0x9 0
#define IMXRT_PAD_GPIO_AD_24_GPIO9_IO23 0x16C 0x3B0 0 0xA 0

#define IMXRT_PAD_GPIO_AD_25_GPIO9_IO24 0x170 0x3B4 0 0xA 0
#define IMXRT_PAD_GPIO_AD_25_LPUART1_RXD 0x170 0x3B4 0x61C 0x0 0
#define IMXRT_PAD_GPIO_AD_25_LPSPI2_PCS0 0x170 0x3B4 0x5DC 0x1 0
#define IMXRT_PAD_GPIO_AD_25_VIDEO_MUX_CSI_DATA01 0x170 0x3B4 0 0x2 0
#define IMXRT_PAD_GPIO_AD_25_ENET_RX_ER 0x170 0x3B4 0x4BC 0x3 0
#define IMXRT_PAD_GPIO_AD_25_FLEXPWM2_PWM0_B 0x170 0x3B4 0x524 0x4 1
#define IMXRT_PAD_GPIO_AD_25_GPIO_MUX3_IO24 0x170 0x3B4 0 0x5 0
#define IMXRT_PAD_GPIO_AD_25_KPP_COL05 0x170 0x3B4 0 0x6 0
#define IMXRT_PAD_GPIO_AD_25_FLEXIO2_D25 0x170 0x3B4 0 0x8 0
#define IMXRT_PAD_GPIO_AD_25_LPI2C4_SDA 0x170 0x3B4 0x5C8 0x9 0

