hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_AD_26_LPUART1_CTS_B 0x174 0x3B8 0 0x0 0
#define IMXRT_PAD_GPIO_AD_26_LPSPI2_SOUT 0x174 0x3B8 0x5EC 0x1 0
#define IMXRT_PAD_GPIO_AD_26_SEMC_CSX01 0x174 0x3B8 0 0x2 0
#define IMXRT_PAD_GPIO_AD_26_ENET_RX_DATA00 0x174 0x3B8 0x4B0 0x3 0
#define IMXRT_PAD_GPIO_AD_26_FLEXPWM2_PWM1_A 0x174 0x3B8 0x51C 0x4 1
#define IMXRT_PAD_GPIO_AD_26_GPIO_MUX3_IO25 0x174 0x3B8 0 0x5 0
#define IMXRT_PAD_GPIO_AD_26_KPP_ROW04 0x174 0x3B8 0 0x6 0
#define IMXRT_PAD_GPIO_AD_26_FLEXIO2_D26 0x174 0x3B8 0 0x8 0
#define IMXRT_PAD_GPIO_AD_26_ENET_QOS_MDC 0x174 0x3B8 0 0x9 0
#define IMXRT_PAD_GPIO_AD_26_GPIO9_IO25 0x174 0x3B8 0 0xA 0
#define IMXRT_PAD_GPIO_AD_26_USDHC2_CD_B 0x174 0x3B8 0x6D0 0xB 1

#define IMXRT_PAD_GPIO_AD_27_LPUART1_RTS_B 0x178 0x3BC 0 0x0 0
#define IMXRT_PAD_GPIO_AD_27_LPSPI2_SIN 0x178 0x3BC 0x5E8 0x1 0
#define IMXRT_PAD_GPIO_AD_27_SEMC_CSX02 0x178 0x3BC 0 0x2 0
#define IMXRT_PAD_GPIO_AD_27_ENET_RX_DATA01 0x178 0x3BC 0x4B4 0x3 0
#define IMXRT_PAD_GPIO_AD_27_FLEXPWM2_PWM1_B 0x178 0x3BC 0x528 0x4 1
#define IMXRT_PAD_GPIO_AD_27_GPIO_MUX3_IO26 0x178 0x3BC 0 0x5 0
#define IMXRT_PAD_GPIO_AD_27_KPP_COL04 0x178 0x3BC 0 0x6 0
#define IMXRT_PAD_GPIO_AD_27_FLEXIO2_D27 0x178 0x3BC 0 0x8 0
#define IMXRT_PAD_GPIO_AD_27_ENET_QOS_MDIO 0x178 0x3BC 0x4EC 0x9 1
#define IMXRT_PAD_GPIO_AD_27_GPIO9_IO26 0x178 0x3BC 0 0xA 0
#define IMXRT_PAD_GPIO_AD_27_USDHC2_WP 0x178 0x3BC 0x6D4 0xB 1

#define IMXRT_PAD_GPIO_AD_28_GPIO9_IO27 0x17C 0x3C0 0 0xA 0
#define IMXRT_PAD_GPIO_AD_28_USDHC2_VSELECT 0x17C 0x3C0 0 0xB 0
#define IMXRT_PAD_GPIO_AD_28_LPSPI1_SCK 0x17C 0x3C0 0x5D0 0x0 1
#define IMXRT_PAD_GPIO_AD_28_LPUART5_TXD 0x17C 0x3C0 0 0x1 0
#define IMXRT_PAD_GPIO_AD_28_SEMC_CSX03 0x17C 0x3C0 0 0x2 0
#define IMXRT_PAD_GPIO_AD_28_ENET_TX_EN 0x17C 0x3C0 0 0x3 0
#define IMXRT_PAD_GPIO_AD_28_FLEXPWM2_PWM2_A 0x17C 0x3C0 0x520 0x4 1
#define IMXRT_PAD_GPIO_AD_28_GPIO_MUX3_IO27 0x17C 0x3C0 0 0x5 0
#define IMXRT_PAD_GPIO_AD_28_KPP_ROW03 0x17C 0x3C0 0 0x6 0
#define IMXRT_PAD_GPIO_AD_28_FLEXIO2_D28 0x17C 0x3C0 0 0x8 0
#define IMXRT_PAD_GPIO_AD_28_VIDEO_MUX_EXT_DCIC1 0x17C 0x3C0 0 0x9 0

#define IMXRT_PAD_GPIO_AD_29_LPSPI1_PCS0 0x180 0x3C4 0x5CC 0x0 1
#define IMXRT_PAD_GPIO_AD_29_LPUART5_RXD 0x180 0x3C4 0 0x1 0
#define IMXRT_PAD_GPIO_AD_29_ENET_REF_CLK 0x180 0x3C4 0x4A8 0x2 0
#define IMXRT_PAD_GPIO_AD_29_ENET_TX_CLK 0x180 0x3C4 0x4C0 0x3 0
#define IMXRT_PAD_GPIO_AD_29_FLEXPWM2_PWM2_B 0x180 0x3C4 0x52C 0x4 1
#define IMXRT_PAD_GPIO_AD_29_GPIO_MUX3_IO28 0x180 0x3C4 0 0x5 0
#define IMXRT_PAD_GPIO_AD_29_KPP_COL03 0x180 0x3C4 0 0x6 0
#define IMXRT_PAD_GPIO_AD_29_FLEXIO2_D29 0x180 0x3C4 0 0x8 0
#define IMXRT_PAD_GPIO_AD_29_VIDEO_MUX_EXT_DCIC2 0x180 0x3C4 0 0x9 0
#define IMXRT_PAD_GPIO_AD_29_GPIO9_IO28 0x180 0x3C4 0 0xA 0
#define IMXRT_PAD_GPIO_AD_29_USDHC2_RESET_B 0x180 0x3C4 0 0xB 0

#define IMXRT_PAD_GPIO_AD_30_LPSPI1_SOUT 0x184 0x3C8 0x5D8 0x0 1
#define IMXRT_PAD_GPIO_AD_30_USB_OTG2_OC 0x184 0x3C8 0x6B8 0x1 1
#define IMXRT_PAD_GPIO_AD_30_FLEXCAN2_TX 0x184 0x3C8 0 0x2 0
#define IMXRT_PAD_GPIO_AD_30_ENET_TX_DATA00 0x184 0x3C8 0 0x3 0
#define IMXRT_PAD_GPIO_AD_30_LPUART3_TXD 0x184 0x3C8 0 0x4 0
#define IMXRT_PAD_GPIO_AD_30_GPIO_MUX3_IO29 0x184 0x3C8 0 0x5 0
#define IMXRT_PAD_GPIO_AD_30_KPP_ROW02 0x184 0x3C8 0 0x6 0
#define IMXRT_PAD_GPIO_AD_30_FLEXIO2_D30 0x184 0x3C8 0 0x8 0
#define IMXRT_PAD_GPIO_AD_30_WDOG2_RESET_B_DEB 0x184 0x3C8 0 0x9 0
#define IMXRT_PAD_GPIO_AD_30_GPIO9_IO29 0x184 0x3C8 0 0xA 0

#define IMXRT_PAD_GPIO_AD_31_LPSPI1_SIN 0x188 0x3CC 0x5D4 0x0 1
#define IMXRT_PAD_GPIO_AD_31_USB_OTG2_PWR 0x188 0x3CC 0 0x1 0
#define IMXRT_PAD_GPIO_AD_31_FLEXCAN2_RX 0x188 0x3CC 0x49C 0x2 1
#define IMXRT_PAD_GPIO_AD_31_ENET_TX_DATA01 0x188 0x3CC 0 0x3 0
#define IMXRT_PAD_GPIO_AD_31_LPUART3_RXD 0x188 0x3CC 0 0x4 0
#define IMXRT_PAD_GPIO_AD_31_GPIO_MUX3_IO30 0x188 0x3CC 0 0x5 0
#define IMXRT_PAD_GPIO_AD_31_KPP_COL02 0x188 0x3CC 0 0x6 0
#define IMXRT_PAD_GPIO_AD_31_FLEXIO2_D31 0x188 0x3CC 0 0x8 0
#define IMXRT_PAD_GPIO_AD_31_WDOG1_RESET_B_DEB 0x188 0x3CC 0 0x9 0
#define IMXRT_PAD_GPIO_AD_31_GPIO9_IO30 0x188 0x3CC 0 0xA 0

#define IMXRT_PAD_GPIO_AD_32_GPIO9_IO31 0x18C 0x3D0 0 0xA 0
#define IMXRT_PAD_GPIO_AD_32_LPI2C1_SCL 0x18C 0x3D0 0x5AC 0x0 1
#define IMXRT_PAD_GPIO_AD_32_USBPHY2_OTG_ID 0x18C 0x3D0 0x6C4 0x1 1
#define IMXRT_PAD_GPIO_AD_32_PGMC_PMIC_RDY 0x18C 0x3D0 0 0x2 0
#define IMXRT_PAD_GPIO_AD_32_ENET_MDC 0x18C 0x3D0 0 0x3 0
#define IMXRT_PAD_GPIO_AD_32_USDHC1_CD_B 0x18C 0x3D0 0x6C8 0x4 0
#define IMXRT_PAD_GPIO_AD_32_GPIO_MUX3_IO31 0x18C 0x3D0 0 0x5 0
#define IMXRT_PAD_GPIO_AD_32_KPP_ROW01 0x18C 0x3D0 0 0x6 0
#define IMXRT_PAD_GPIO_AD_32_LPUART10_TXD 0x18C 0x3D0 0x628 0x8 1
#define IMXRT_PAD_GPIO_AD_32_ENET_1G_MDC 0x18C 0x3D0 0 0x9 0

#define IMXRT_PAD_GPIO_AD_33_LPI2C1_SDA 0x190 0x3D4 0x5B0 0x0 1
#define IMXRT_PAD_GPIO_AD_33_USBPHY1_OTG_ID 0x190 0x3D4 0x6C0 0x1 1
#define IMXRT_PAD_GPIO_AD_33_XBAR1_INOUT17 0x190 0x3D4 0 0x2 0
#define IMXRT_PAD_GPIO_AD_33_ENET_MDIO 0x190 0x3D4 0x4AC 0x3 1
#define IMXRT_PAD_GPIO_AD_33_USDHC1_WP 0x190 0x3D4 0x6CC 0x4 0
#define IMXRT_PAD_GPIO_AD_33_GPIO_MUX4_IO00 0x190 0x3D4 0 0x5 0
#define IMXRT_PAD_GPIO_AD_33_KPP_COL01 0x190 0x3D4 0 0x6 0
#define IMXRT_PAD_GPIO_AD_33_LPUART10_RXD 0x190 0x3D4 0x624 0x8 1
#define IMXRT_PAD_GPIO_AD_33_ENET_1G_MDIO 0x190 0x3D4 0x4C8 0x9 3
#define IMXRT_PAD_GPIO_AD_33_GPIO10_IO00 0x190 0x3D4 0 0xA 0

#define IMXRT_PAD_GPIO_AD_34_ENET_1G_1588_EVENT0_IN 0x194 0x3D8 0 0x0 0
#define IMXRT_PAD_GPIO_AD_34_USB_OTG1_PWR 0x194 0x3D8 0 0x1 0
#define IMXRT_PAD_GPIO_AD_34_XBAR1_INOUT18 0x194 0x3D8 0 0x2 0
#define IMXRT_PAD_GPIO_AD_34_ENET_1588_EVENT0_IN 0x194 0x3D8 0 0x3 0
#define IMXRT_PAD_GPIO_AD_34_USDHC1_VSELECT 0x194 0x3D8 0 0x4 0
#define IMXRT_PAD_GPIO_AD_34_GPIO_MUX4_IO01 0x194 0x3D8 0 0x5 0
#define IMXRT_PAD_GPIO_AD_34_KPP_ROW00 0x194 0x3D8 0 0x6 0
#define IMXRT_PAD_GPIO_AD_34_LPUART10_CTS_B 0x194 0x3D8 0 0x8 0
#define IMXRT_PAD_GPIO_AD_34_WDOG1_ANY 0x194 0x3D8 0 0x9 0
#define IMXRT_PAD_GPIO_AD_34_GPIO10_IO01 0x194 0x3D8 0 0xA 0

#define IMXRT_PAD_GPIO_AD_35_GPIO10_IO02 0x198 0x3DC 0 0xA 0
#define IMXRT_PAD_GPIO_AD_35_ENET_1G_1588_EVENT0_OUT 0x198 0x3DC 0 0x0 0
#define IMXRT_PAD_GPIO_AD_35_USB_OTG1_OC 0x198 0x3DC 0x6BC 0x1 1
#define IMXRT_PAD_GPIO_AD_35_XBAR1_INOUT19 0x198 0x3DC 0 0x2 0
#define IMXRT_PAD_GPIO_AD_35_ENET_1588_EVENT0_OUT 0x198 0x3DC 0 0x3 0
#define IMXRT_PAD_GPIO_AD_35_USDHC1_RESET_B 0x198 0x3DC 0 0x4 0
#define IMXRT_PAD_GPIO_AD_35_GPIO_MUX4_IO02 0x198 0x3DC 0 0x5 0
#define IMXRT_PAD_GPIO_AD_35_KPP_COL00 0x198 0x3DC 0 0x6 0
#define IMXRT_PAD_GPIO_AD_35_LPUART10_RTS_B 0x198 0x3DC 0 0x8 0
#define IMXRT_PAD_GPIO_AD_35_FLEXSPI1_B_SS1_B 0x198 0x3DC 0 0x9 0

#define IMXRT_PAD_GPIO_SD_B1_00_USDHC1_CMD 0x19C 0x3E0 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B1_00_XBAR1_INOUT20 0x19C 0x3E0 0x6D8 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_00_GPT4_CAPTURE1 0x19C 0x3E0 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B1_00_GPIO_MUX4_IO03 0x19C 0x3E0 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B1_00_FLEXSPI2_A_SS0_B 0x19C 0x3E0 0 0x6 0
#define IMXRT_PAD_GPIO_SD_B1_00_KPP_ROW07 0x19C 0x3E0 0x5A8 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_00_GPIO10_IO03 0x19C 0x3E0 0 0xA 0

#define IMXRT_PAD_GPIO_SD_B1_01_USDHC1_CLK 0x1A0 0x3E4 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B1_01_XBAR1_INOUT21 0x1A0 0x3E4 0x6DC 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_01_GPT4_CAPTURE2 0x1A0 0x3E4 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B1_01_GPIO_MUX4_IO04 0x1A0 0x3E4 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B1_01_FLEXSPI2_A_SCLK 0x1A0 0x3E4 0x58C 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_01_KPP_COL07 0x1A0 0x3E4 0x5A0 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_01_GPIO10_IO04 0x1A0 0x3E4 0 0xA 0

#define IMXRT_PAD_GPIO_SD_B1_02_GPIO10_IO05 0x1A4 0x3E8 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B1_02_USDHC1_DATA0 0x1A4 0x3E8 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B1_02_XBAR1_INOUT22 0x1A4 0x3E8 0x6E0 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_02_GPT4_COMPARE1 0x1A4 0x3E8 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B1_02_GPIO_MUX4_IO05 0x1A4 0x3E8 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B1_02_FLEXSPI2_A_DATA00 0x1A4 0x3E8 0x57C 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_02_KPP_ROW06 0x1A4 0x3E8 0x5A4 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_02_FLEXSPI1_A_SS1_B 0x1A4 0x3E8 0 0x9 0

#define IMXRT_PAD_GPIO_SD_B1_03_USDHC1_DATA1 0x1A8 0x3EC 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B1_03_XBAR1_INOUT23 0x1A8 0x3EC 0x6E4 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_03_GPT4_COMPARE2 0x1A8 0x3EC 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B1_03_GPIO_MUX4_IO06 0x1A8 0x3EC 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B1_03_FLEXSPI2_A_DATA01 0x1A8 0x3EC 0x580 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_03_KPP_COL06 0x1A8 0x3EC 0x59C 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_03_FLEXSPI1_B_SS1_B 0x1A8 0x3EC 0 0x9 0
#define IMXRT_PAD_GPIO_SD_B1_03_GPIO10_IO06 0x1A8 0x3EC 0 0xA 0

#define IMXRT_PAD_GPIO_SD_B1_04_USDHC1_DATA2 0x1AC 0x3F0 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B1_04_XBAR1_INOUT24 0x1AC 0x3F0 0x6E8 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_04_GPT4_COMPARE3 0x1AC 0x3F0 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B1_04_GPIO_MUX4_IO07 0x1AC 0x3F0 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B1_04_FLEXSPI2_A_DATA02 0x1AC 0x3F0 0x584 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_04_FLEXSPI1_B_SS0_B 0x1AC 0x3F0 0 0x8 0
#define IMXRT_PAD_GPIO_SD_B1_04_ENET_QOS_1588_EVENT2_AUX_IN 0x1AC 0x3F0 0 0x9 0
#define IMXRT_PAD_GPIO_SD_B1_04_GPIO10_IO07 0x1AC 0x3F0 0 0xA 0

#define IMXRT_PAD_GPIO_SD_B1_05_GPIO10_IO08 0x1B0 0x3F4 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B1_05_USDHC1_DATA3 0x1B0 0x3F4 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B1_05_XBAR1_INOUT25 0x1B0 0x3F4 0x6EC 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_05_GPT4_CLK 0x1B0 0x3F4 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B1_05_GPIO_MUX4_IO08 0x1B0 0x3F4 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B1_05_FLEXSPI2_A_DATA03 0x1B0 0x3F4 0x588 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_05_FLEXSPI1_B_DQS 0x1B0 0x3F4 0 0x8 0
#define IMXRT_PAD_GPIO_SD_B1_05_ENET_QOS_1588_EVENT3_AUX_IN 0x1B0 0x3F4 0 0x9 0

#define IMXRT_PAD_GPIO_SD_B2_00_GPIO10_IO09 0x1B4 0x3F8 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_00_USDHC2_DATA3 0x1B4 0x3F8 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_00_FLEXSPI1_B_DATA03 0x1B4 0x3F8 0x570 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_00_ENET_1G_RX_EN 0x1B4 0x3F8 0x4E0 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_00_LPUART9_TXD 0x1B4 0x3F8 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_00_LPSPI4_SCK 0x1B4 0x3F8 0x610 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_00_GPIO_MUX4_IO09 0x1B4 0x3F8 0 0x5 0

#define IMXRT_PAD_GPIO_SD_B2_01_USDHC2_DATA2 0x1B8 0x3FC 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_01_FLEXSPI1_B_DATA02 0x1B8 0x3FC 0x56C 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_01_ENET_1G_RX_CLK 0x1B8 0x3FC 0x4CC 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_01_LPUART9_RXD 0x1B8 0x3FC 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_01_LPSPI4_PCS0 0x1B8 0x3FC 0x60C 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_01_GPIO_MUX4_IO10 0x1B8 0x3FC 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_01_GPIO10_IO10 0x1B8 0x3FC 0 0xA 0

