hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_SD_B2_02_GPIO10_IO11 0x1BC 0x400 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_02_USDHC2_DATA1 0x1BC 0x400 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_02_FLEXSPI1_B_DATA01 0x1BC 0x400 0x568 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_02_ENET_1G_RX_DATA00 0x1BC 0x400 0x4D0 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_02_LPUART9_CTS_B 0x1BC 0x400 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_02_LPSPI4_SOUT 0x1BC 0x400 0x618 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_02_GPIO_MUX4_IO11 0x1BC 0x400 0 0x5 0

#define IMXRT_PAD_GPIO_SD_B2_03_GPIO10_IO12 0x1C0 0x404 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_03_USDHC2_DATA0 0x1C0 0x404 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_03_FLEXSPI1_B_DATA00 0x1C0 0x404 0x564 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_03_ENET_1G_RX_DATA01 0x1C0 0x404 0x4D4 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_03_LPUART9_RTS_B 0x1C0 0x404 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_03_LPSPI4_SIN 0x1C0 0x404 0x614 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_03_GPIO_MUX4_IO12 0x1C0 0x404 0 0x5 0

#define IMXRT_PAD_GPIO_SD_B2_04_USDHC2_CLK 0x1C4 0x408 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_04_FLEXSPI1_B_SCLK 0x1C4 0x408 0x578 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_04_ENET_1G_RX_DATA02 0x1C4 0x408 0x4D8 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_04_FLEXSPI1_A_SS1_B 0x1C4 0x408 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_04_LPSPI4_PCS1 0x1C4 0x408 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_04_GPIO_MUX4_IO13 0x1C4 0x408 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_04_GPIO10_IO13 0x1C4 0x408 0 0xA 0

#define IMXRT_PAD_GPIO_SD_B2_05_GPIO10_IO14 0x1C8 0x40C 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_05_USDHC2_CMD 0x1C8 0x40C 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_05_FLEXSPI1_A_DQS 0x1C8 0x40C 0x550 0x1 2
#define IMXRT_PAD_GPIO_SD_B2_05_ENET_1G_RX_DATA03 0x1C8 0x40C 0x4DC 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_05_FLEXSPI1_B_SS0_B 0x1C8 0x40C 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_05_LPSPI4_PCS2 0x1C8 0x40C 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_05_GPIO_MUX4_IO14 0x1C8 0x40C 0 0x5 0

#define IMXRT_PAD_GPIO_SD_B2_06_GPIO10_IO15 0x1CC 0x410 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_06_USDHC2_RESET_B 0x1CC 0x410 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B 0x1CC 0x410 0 0x1 0
#define IMXRT_PAD_GPIO_SD_B2_06_ENET_1G_TX_DATA03 0x1CC 0x410 0 0x2 0
#define IMXRT_PAD_GPIO_SD_B2_06_LPSPI4_PCS3 0x1CC 0x410 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_06_GPT6_CAPTURE1 0x1CC 0x410 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_06_GPIO_MUX4_IO15 0x1CC 0x410 0 0x5 0

#define IMXRT_PAD_GPIO_SD_B2_07_USDHC2_STROBE 0x1D0 0x414 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_07_FLEXSPI1_A_SCLK 0x1D0 0x414 0x574 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_07_ENET_1G_TX_DATA02 0x1D0 0x414 0 0x2 0
#define IMXRT_PAD_GPIO_SD_B2_07_LPUART3_CTS_B 0x1D0 0x414 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_07_GPT6_CAPTURE2 0x1D0 0x414 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_07_GPIO_MUX4_IO16 0x1D0 0x414 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_07_LPSPI2_SCK 0x1D0 0x414 0x5E4 0x6 1
#define IMXRT_PAD_GPIO_SD_B2_07_ENET_TX_ER 0x1D0 0x414 0 0x8 0
#define IMXRT_PAD_GPIO_SD_B2_07_ENET_QOS_REF_CLK 0x1D0 0x414 0x4A0 0x9 1
#define IMXRT_PAD_GPIO_SD_B2_07_GPIO10_IO16 0x1D0 0x414 0 0xA 0

#define IMXRT_PAD_GPIO_SD_B2_08_GPIO10_IO17 0x1D4 0x418 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_08_USDHC2_DATA4 0x1D4 0x418 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_08_FLEXSPI1_A_DATA00 0x1D4 0x418 0x554 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_08_ENET_1G_TX_DATA01 0x1D4 0x418 0 0x2 0
#define IMXRT_PAD_GPIO_SD_B2_08_LPUART3_RTS_B 0x1D4 0x418 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_08_GPT6_COMPARE1 0x1D4 0x418 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_08_GPIO_MUX4_IO17 0x1D4 0x418 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_08_LPSPI2_PCS0 0x1D4 0x418 0x5DC 0x6 1

#define IMXRT_PAD_GPIO_SD_B2_09_GPIO10_IO18 0x1D8 0x41C 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_09_USDHC2_DATA5 0x1D8 0x41C 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_09_FLEXSPI1_A_DATA01 0x1D8 0x41C 0x558 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_09_ENET_1G_TX_DATA00 0x1D8 0x41C 0 0x2 0
#define IMXRT_PAD_GPIO_SD_B2_09_LPUART5_CTS_B 0x1D8 0x41C 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_09_GPT6_COMPARE2 0x1D8 0x41C 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_09_GPIO_MUX4_IO18 0x1D8 0x41C 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_09_LPSPI2_SOUT 0x1D8 0x41C 0x5EC 0x6 1

#define IMXRT_PAD_GPIO_SD_B2_10_GPIO10_IO19 0x1DC 0x420 0 0xA 0
#define IMXRT_PAD_GPIO_SD_B2_10_USDHC2_DATA6 0x1DC 0x420 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_10_FLEXSPI1_A_DATA02 0x1DC 0x420 0x55C 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_10_ENET_1G_TX_EN 0x1DC 0x420 0 0x2 0
#define IMXRT_PAD_GPIO_SD_B2_10_LPUART5_RTS_B 0x1DC 0x420 0 0x3 0
#define IMXRT_PAD_GPIO_SD_B2_10_GPT6_COMPARE3 0x1DC 0x420 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_10_GPIO_MUX4_IO19 0x1DC 0x420 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_10_LPSPI2_SIN 0x1DC 0x420 0x5E8 0x6 1

#define IMXRT_PAD_GPIO_SD_B2_11_USDHC2_DATA7 0x1E0 0x424 0 0x0 0
#define IMXRT_PAD_GPIO_SD_B2_11_FLEXSPI1_A_DATA03 0x1E0 0x424 0x560 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_11_ENET_1G_TX_CLK_IO 0x1E0 0x424 0x4E8 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_11_ENET_1G_REF_CLK 0x1E0 0x424 0x4C4 0x3 1
#define IMXRT_PAD_GPIO_SD_B2_11_GPT6_CLK 0x1E0 0x424 0 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_11_GPIO_MUX4_IO20 0x1E0 0x424 0 0x5 0
#define IMXRT_PAD_GPIO_SD_B2_11_LPSPI2_PCS1 0x1E0 0x424 0x5E0 0x6 1
#define IMXRT_PAD_GPIO_SD_B2_11_GPIO10_IO20 0x1E0 0x424 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK 0x1E4 0x428 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_00_ENET_1G_RX_EN 0x1E4 0x428 0x4E0 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_00_TMR1_TIMER0 0x1E4 0x428 0x63C 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_00_XBAR1_INOUT26 0x1E4 0x428 0x6F0 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_00_GPIO_MUX4_IO21 0x1E4 0x428 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_00_ENET_QOS_RX_EN 0x1E4 0x428 0x4F8 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_00_GPIO10_IO21 0x1E4 0x428 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE 0x1E8 0x42C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_1G_RX_CLK 0x1E8 0x42C 0x4CC 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_1G_RX_ER 0x1E8 0x42C 0x4E4 0x2 1
#define IMXRT_PAD_GPIO_DISP_B1_01_TMR1_TIMER1 0x1E8 0x42C 0x640 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_01_XBAR1_INOUT27 0x1E8 0x42C 0x6F4 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_01_GPIO_MUX4_IO22 0x1E8 0x42C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_QOS_RX_CLK 0x1E8 0x42C 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_QOS_RX_ER 0x1E8 0x42C 0x4FC 0x9 0
#define IMXRT_PAD_GPIO_DISP_B1_01_GPIO10_IO22 0x1E8 0x42C 0 0xA 0

