hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_DISP_B1_02_GPIO10_IO23 0x1EC 0x430 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC 0x1EC 0x430 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_02_ENET_1G_RX_DATA00 0x1EC 0x430 0x4D0 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_02_LPI2C3_SCL 0x1EC 0x430 0x5BC 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_02_TMR1_TIMER2 0x1EC 0x430 0x644 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_02_XBAR1_INOUT28 0x1EC 0x430 0x6F8 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_02_GPIO_MUX4_IO23 0x1EC 0x430 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_02_ENET_QOS_RX_DATA00 0x1EC 0x430 0x4F0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_02_LPUART1_TXD 0x1EC 0x430 0x620 0x9 1

#define IMXRT_PAD_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC 0x1F0 0x434 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_03_ENET_1G_RX_DATA01 0x1F0 0x434 0x4D4 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_03_LPI2C3_SDA 0x1F0 0x434 0x5C0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_03_TMR2_TIMER0 0x1F0 0x434 0x648 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_03_XBAR1_INOUT29 0x1F0 0x434 0x6FC 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_03_GPIO_MUX4_IO24 0x1F0 0x434 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_03_ENET_QOS_RX_DATA01 0x1F0 0x434 0x4F4 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_03_LPUART1_RXD 0x1F0 0x434 0x61C 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_03_GPIO10_IO24 0x1F0 0x434 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00 0x1F4 0x438 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_04_ENET_1G_RX_DATA02 0x1F4 0x438 0x4D8 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_04_LPUART4_RXD 0x1F4 0x438 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_04_TMR2_TIMER1 0x1F4 0x438 0x64C 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_04_XBAR1_INOUT30 0x1F4 0x438 0x700 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_04_GPIO_MUX4_IO25 0x1F4 0x438 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_04_ENET_QOS_RX_DATA02 0x1F4 0x438 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_04_LPSPI3_SCK 0x1F4 0x438 0x600 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_04_GPIO10_IO25 0x1F4 0x438 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_05_GPIO10_IO26 0x1F8 0x43C 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01 0x1F8 0x43C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_05_ENET_1G_RX_DATA03 0x1F8 0x43C 0x4DC 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_05_LPUART4_CTS_B 0x1F8 0x43C 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_05_TMR2_TIMER2 0x1F8 0x43C 0x650 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_05_XBAR1_INOUT31 0x1F8 0x43C 0x704 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_05_GPIO_MUX4_IO26 0x1F8 0x43C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_05_ENET_QOS_RX_DATA03 0x1F8 0x43C 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_05_LPSPI3_SIN 0x1F8 0x43C 0x604 0x9 1

#define IMXRT_PAD_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02 0x1FC 0x440 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_06_ENET_1G_TX_DATA03 0x1FC 0x440 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_06_LPUART4_TXD 0x1FC 0x440 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_06_TMR3_TIMER0 0x1FC 0x440 0x654 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_06_XBAR1_INOUT32 0x1FC 0x440 0x708 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_06_GPIO_MUX4_IO27 0x1FC 0x440 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_06_SRC_BT_CFG00 0x1FC 0x440 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_06_ENET_QOS_TX_DATA03 0x1FC 0x440 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_06_LPSPI3_SOUT 0x1FC 0x440 0x608 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_06_GPIO10_IO27 0x1FC 0x440 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03 0x200 0x444 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_07_ENET_1G_TX_DATA02 0x200 0x444 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_07_LPUART4_RTS_B 0x200 0x444 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_07_TMR3_TIMER1 0x200 0x444 0x658 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_07_XBAR1_INOUT33 0x200 0x444 0x70C 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_07_GPIO_MUX4_IO28 0x200 0x444 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_07_SRC_BT_CFG01 0x200 0x444 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_07_ENET_QOS_TX_DATA02 0x200 0x444 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_07_LPSPI3_PCS0 0x200 0x444 0x5F0 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_07_GPIO10_IO28 0x200 0x444 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_08_GPIO10_IO29 0x204 0x448 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04 0x204 0x448 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_08_ENET_1G_TX_DATA01 0x204 0x448 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_08_USDHC1_CD_B 0x204 0x448 0x6C8 0x2 1
#define IMXRT_PAD_GPIO_DISP_B1_08_TMR3_TIMER2 0x204 0x448 0x65C 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_08_XBAR1_INOUT34 0x204 0x448 0x710 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_08_GPIO_MUX4_IO29 0x204 0x448 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_08_SRC_BT_CFG02 0x204 0x448 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_08_ENET_QOS_TX_DATA01 0x204 0x448 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_08_LPSPI3_PCS1 0x204 0x448 0x5F4 0x9 1

#define IMXRT_PAD_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05 0x208 0x44C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_09_ENET_1G_TX_DATA00 0x208 0x44C 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_09_USDHC1_WP 0x208 0x44C 0x6CC 0x2 1
#define IMXRT_PAD_GPIO_DISP_B1_09_TMR4_TIMER0 0x208 0x44C 0x660 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_09_XBAR1_INOUT35 0x208 0x44C 0x714 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_09_GPIO_MUX4_IO30 0x208 0x44C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_09_SRC_BT_CFG03 0x208 0x44C 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_09_ENET_QOS_TX_DATA00 0x208 0x44C 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_09_LPSPI3_PCS2 0x208 0x44C 0x5F8 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_09_GPIO10_IO30 0x208 0x44C 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06 0x20C 0x450 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_10_ENET_1G_TX_EN 0x20C 0x450 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_10_USDHC1_RESET_B 0x20C 0x450 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_10_TMR4_TIMER1 0x20C 0x450 0x664 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_10_XBAR1_INOUT36 0x20C 0x450 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B1_10_GPIO_MUX4_IO31 0x20C 0x450 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_10_SRC_BT_CFG04 0x20C 0x450 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_10_ENET_QOS_TX_EN 0x20C 0x450 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_10_LPSPI3_PCS3 0x20C 0x450 0x5FC 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_10_GPIO10_IO31 0x20C 0x450 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07 0x210 0x454 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_1G_TX_CLK_IO 0x210 0x454 0x4E8 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_1G_REF_CLK 0x210 0x454 0x4C4 0x2 2
#define IMXRT_PAD_GPIO_DISP_B1_11_TMR4_TIMER2 0x210 0x454 0x668 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_11_XBAR1_INOUT37 0x210 0x454 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B1_11_GPIO_MUX5_IO00 0x210 0x454 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_11_SRC_BT_CFG05 0x210 0x454 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_QOS_TX_CLK 0x210 0x454 0x4A4 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_QOS_REF_CLK 0x210 0x454 0x4A0 0x9 2
#define IMXRT_PAD_GPIO_DISP_B1_11_GPIO11_IO00 0x210 0x454 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_00_GPIO11_IO01 0x214 0x458 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08 0x214 0x458 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_00_WDOG1_B 0x214 0x458 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_00_MQS_RIGHT 0x214 0x458 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_00_ENET_1G_TX_ER 0x214 0x458 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_00_SAI1_TX_DATA03 0x214 0x458 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_00_GPIO_MUX5_IO01 0x214 0x458 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_00_SRC_BT_CFG06 0x214 0x458 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_00_ENET_QOS_TX_ER 0x214 0x458 0 0x8 0

#define IMXRT_PAD_GPIO_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09 0x218 0x45C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_01_USDHC1_VSELECT 0x218 0x45C 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_01_MQS_LEFT 0x218 0x45C 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_01_WDOG2_B 0x218 0x45C 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_01_SAI1_TX_DATA02 0x218 0x45C 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_01_GPIO_MUX5_IO02 0x218 0x45C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_01_SRC_BT_CFG07 0x218 0x45C 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_01_EWM_OUT_B 0x218 0x45C 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_01_CCM_ENET_REF_CLK_25M 0x218 0x45C 0 0x9 0
#define IMXRT_PAD_GPIO_DISP_B2_01_GPIO11_IO02 0x218 0x45C 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_02_GPIO11_IO03 0x21C 0x460 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10 0x21C 0x460 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_02_ENET_TX_DATA00 0x21C 0x460 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_02_PIT1_TRIGGER3 0x21C 0x460 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_02_ARM_TRACE00 0x21C 0x460 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_02_SAI1_TX_DATA01 0x21C 0x460 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_02_GPIO_MUX5_IO03 0x21C 0x460 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_02_SRC_BT_CFG08 0x21C 0x460 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_02_ENET_QOS_TX_DATA00 0x21C 0x460 0 0x8 0

#define IMXRT_PAD_GPIO_DISP_B2_03_GPIO11_IO04 0x220 0x464 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_03_VIDEO_MUX_LCDIF_DATA11 0x220 0x464 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_03_ENET_TX_DATA01 0x220 0x464 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_03_PIT1_TRIGGER2 0x220 0x464 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_03_ARM_TRACE01 0x220 0x464 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_03_SAI1_MCLK 0x220 0x464 0x66C 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_03_GPIO_MUX5_IO04 0x220 0x464 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_03_SRC_BT_CFG09 0x220 0x464 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_03_ENET_QOS_TX_DATA01 0x220 0x464 0 0x8 0

#define IMXRT_PAD_GPIO_DISP_B2_04_VIDEO_MUX_LCDIF_DATA12 0x224 0x468 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_04_ENET_TX_EN 0x224 0x468 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_04_PIT1_TRIGGER1 0x224 0x468 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_04_ARM_TRACE02 0x224 0x468 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_04_SAI1_RX_SYNC 0x224 0x468 0x678 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_04_GPIO_MUX5_IO05 0x224 0x468 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_04_SRC_BT_CFG10 0x224 0x468 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_04_ENET_QOS_TX_EN 0x224 0x468 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_04_GPIO11_IO05 0x224 0x468 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_05_GPIO11_IO06 0x228 0x46C 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_05_VIDEO_MUX_LCDIF_DATA13 0x228 0x46C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_05_ENET_TX_CLK 0x228 0x46C 0x4C0 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_05_ENET_REF_CLK 0x228 0x46C 0x4A8 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_05_ARM_TRACE03 0x228 0x46C 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_05_SAI1_RX_BCLK 0x228 0x46C 0x670 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_05_GPIO_MUX5_IO06 0x228 0x46C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_05_SRC_BT_CFG11 0x228 0x46C 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_05_ENET_QOS_TX_CLK 0x228 0x46C 0x4A4 0x8 1

