hlfortunali/rt1170_rtems_source/bsps/arm/imxrt/include/imxrt/imxrt1176-pinfunc.h
#define IMXRT_PAD_GPIO_DISP_B2_06_GPIO11_IO07 0x22C 0x470 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_06_VIDEO_MUX_LCDIF_DATA14 0x22C 0x470 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_06_ENET_RX_DATA00 0x22C 0x470 0x4B0 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_06_LPUART7_TXD 0x22C 0x470 0x630 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_06_ARM_TRACE_CLK 0x22C 0x470 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_06_SAI1_RX_DATA00 0x22C 0x470 0x674 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_06_GPIO_MUX5_IO07 0x22C 0x470 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_06_ENET_QOS_RX_DATA00 0x22C 0x470 0x4F0 0x8 1

#define IMXRT_PAD_GPIO_DISP_B2_07_VIDEO_MUX_LCDIF_DATA15 0x230 0x474 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_07_ENET_RX_DATA01 0x230 0x474 0x4B4 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_07_LPUART7_RXD 0x230 0x474 0x62C 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_07_ARM_TRACE_SWO 0x230 0x474 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_07_SAI1_TX_DATA00 0x230 0x474 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_07_GPIO_MUX5_IO08 0x230 0x474 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_07_ENET_QOS_RX_DATA01 0x230 0x474 0x4F4 0x8 1
#define IMXRT_PAD_GPIO_DISP_B2_07_GPIO11_IO08 0x230 0x474 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_08_GPIO11_IO09 0x234 0x478 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_08_VIDEO_MUX_LCDIF_DATA16 0x234 0x478 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_08_ENET_RX_EN 0x234 0x478 0x4B8 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_08_LPUART8_TXD 0x234 0x478 0x638 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_08_ARM_CM7_EVENTO 0x234 0x478 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_08_SAI1_TX_BCLK 0x234 0x478 0x67C 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_08_GPIO_MUX5_IO09 0x234 0x478 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_08_ENET_QOS_RX_EN 0x234 0x478 0x4F8 0x8 1
#define IMXRT_PAD_GPIO_DISP_B2_08_LPUART1_TXD 0x234 0x478 0x620 0x9 2

#define IMXRT_PAD_GPIO_DISP_B2_09_GPIO11_IO10 0x238 0x47C 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_09_VIDEO_MUX_LCDIF_DATA17 0x238 0x47C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_09_ENET_RX_ER 0x238 0x47C 0x4BC 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_09_LPUART8_RXD 0x238 0x47C 0x634 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_09_ARM_CM7_EVENTI 0x238 0x47C 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_09_SAI1_TX_SYNC 0x238 0x47C 0x680 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_09_GPIO_MUX5_IO10 0x238 0x47C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_09_ENET_QOS_RX_ER 0x238 0x47C 0x4FC 0x8 1
#define IMXRT_PAD_GPIO_DISP_B2_09_LPUART1_RXD 0x238 0x47C 0x61C 0x9 2

#define IMXRT_PAD_GPIO_DISP_B2_10_GPIO11_IO11 0x23C 0x480 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_10_VIDEO_MUX_LCDIF_DATA18 0x23C 0x480 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_10_EMVSIM2_IO 0x23C 0x480 0x6A8 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_10_LPUART2_TXD 0x23C 0x480 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_10_WDOG2_RESET_B_DEB 0x23C 0x480 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_10_XBAR1_INOUT38 0x23C 0x480 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_10_GPIO_MUX5_IO11 0x23C 0x480 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_10_LPI2C3_SCL 0x23C 0x480 0x5BC 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_10_ENET_QOS_RX_ER 0x23C 0x480 0x4FC 0x8 2
#define IMXRT_PAD_GPIO_DISP_B2_10_SPDIF_IN 0x23C 0x480 0x6B4 0x9 2

#define IMXRT_PAD_GPIO_DISP_B2_11_VIDEO_MUX_LCDIF_DATA19 0x240 0x484 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_11_EMVSIM2_CLK 0x240 0x484 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_11_LPUART2_RXD 0x240 0x484 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_11_WDOG1_RESET_B_DEB 0x240 0x484 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_11_XBAR1_INOUT39 0x240 0x484 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_11_GPIO_MUX5_IO12 0x240 0x484 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_11_LPI2C3_SDA 0x240 0x484 0x5C0 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_11_ENET_QOS_CRS 0x240 0x484 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_11_SPDIF_OUT 0x240 0x484 0 0x9 0
#define IMXRT_PAD_GPIO_DISP_B2_11_GPIO11_IO12 0x240 0x484 0 0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_12_GPIO11_IO13 0x244 0x488 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_12_VIDEO_MUX_LCDIF_DATA20 0x244 0x488 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_12_EMVSIM2_RST 0x244 0x488 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_12_FLEXCAN1_TX 0x244 0x488 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_12_LPUART2_CTS_B 0x244 0x488 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_12_XBAR1_INOUT40 0x244 0x488 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_12_GPIO_MUX5_IO13 0x244 0x488 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_12_LPI2C4_SCL 0x244 0x488 0x5C4 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_12_ENET_QOS_COL 0x244 0x488 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_12_LPSPI4_SCK 0x244 0x488 0x610 0x9 1

#define IMXRT_PAD_GPIO_DISP_B2_13_GPIO11_IO14 0x248 0x48C 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_13_VIDEO_MUX_LCDIF_DATA21 0x248 0x48C 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_13_EMVSIM2_SVEN 0x248 0x48C 0 0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_13_FLEXCAN1_RX 0x248 0x48C 0x498 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_13_LPUART2_RTS_B 0x248 0x48C 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_13_ENET_REF_CLK 0x248 0x48C 0x4A8 0x4 2
#define IMXRT_PAD_GPIO_DISP_B2_13_GPIO_MUX5_IO14 0x248 0x48C 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_13_LPI2C4_SDA 0x248 0x48C 0x5C8 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_13_ENET_QOS_1588_EVENT0_OUT 0x248 0x48C 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_13_LPSPI4_SIN 0x248 0x48C 0x614 0x9 1

#define IMXRT_PAD_GPIO_DISP_B2_14_GPIO_MUX5_IO15 0x24C 0x490 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_14_FLEXCAN1_TX 0x24C 0x490 0 0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_14_ENET_QOS_1588_EVENT0_IN 0x24C 0x490 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_14_LPSPI4_SOUT 0x24C 0x490 0x618 0x9 1
#define IMXRT_PAD_GPIO_DISP_B2_14_GPIO11_IO15 0x24C 0x490 0 0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_14_VIDEO_MUX_LCDIF_DATA22 0x24C 0x490 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_14_EMVSIM2_PD 0x24C 0x490 0x6AC 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_14_WDOG2_B 0x24C 0x490 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_14_VIDEO_MUX_EXT_DCIC1 0x24C 0x490 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_14_ENET_1G_REF_CLK 0x24C 0x490 0x4C4 0x4 3

#define IMXRT_PAD_GPIO_DISP_B2_15_VIDEO_MUX_LCDIF_DATA23 0x250 0x494 0 0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_15_EMVSIM2_POWER_FAIL 0x250 0x494 0x6B0 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_15_WDOG1_B 0x250 0x494 0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_15_VIDEO_MUX_EXT_DCIC2 0x250 0x494 0 0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_15_PIT1_TRIGGER0 0x250 0x494 0 0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_15_GPIO_MUX5_IO16 0x250 0x494 0 0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_15_FLEXCAN1_RX 0x250 0x494 0x498 0x6 2
#define IMXRT_PAD_GPIO_DISP_B2_15_ENET_QOS_1588_EVENT0_AUX_IN 0x250 0x494 0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_15_LPSPI4_PCS0 0x250 0x494 0x60C 0x9 1
#define IMXRT_PAD_GPIO_DISP_B2_15_GPIO11_IO16 0x250 0x494 0 0xA 0

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* LIBBSP_ARM_IMXRT_IMXRT1050_PINFUNC_H */
